[
    {
        "title": "Military to end Boko Haram insurgency soon – Defence Minister — National Accord Newspaper",
        "external_url": "https://www.nationalaccordnewspaper.com/military-to-end-boko-haram-insurgency-soon-defence-minister/",
        "publication_author": [],
        "publication_date": 1701189850000,
        "description": "",
        "text": "By SADIQ ABUBAKAR, Maiduguri –\n\nThe Minister of Defence, Muhammad Badaru Abubakar, on Tuesday assured that the Nigeria military troops would soon end Boko Haram insurgency in the country.\n\nThe Minister stated this on Tuesday when he led a high powered delegation on a one day operational visit to Borno State and the Theatre Command, Headquarters JTF North East Operation Hadin Kai (OPHK) Maiduguri.\n\nBadaru was accompanied by the Minister of State for Defence, Bello Mattawalle, the Chief of Defence Staff (CDS), Gen. Christopher Musa, Chief of Army Staff (COAS), Lt.-Gen. Taoreed Lagbaja, Chief of Air Staff (CAS), Air Marshal, Hassan Abubakar, Chief of Naval Staff, Vice Admiral Emmanuel Ogalla and Chief of Defence Intelligence (CDI), Maj.-Gen. Emmanuel Undiandeye.\n\nSpeaking to journalists on his mission, the Minister of Defence said, “we are in Maiduguri in company of the high level delegation of the Service Chiefs assigned by President Bola Tinubu, to appraise security situation in the theatre of operation.”\n\n“President Tinubu asked us to visit the governor and the good people of Borno, and our patriotic officers here in Borno to see and to hear from them, what is happening both in the frontline and in the cities. What are the progress being made and what we need to do more to support their operations.\n\n“We had frank and honest discussions with Gov. Bagana Zulum before coming here, where we discussed the way forward and it is our resolve that in no distant future, we will see the end of the insecurity.\n\n“He had also shared a lot of strategies with the CDS and the Service Chiefs and together they agreed on the next line of action and I believe if followed religiously, insecurity in the state will come to an end,” Badaru said.\n\nThe Minister, further, explained that the commitment of the president to support the military and security agencies to end insurgency and restore peace towards sustainable peace and resettlement of displaced persons.\n\n“From here, we will go to see our troops, greet and thank them for their sacrifices, for being their and taken the bullet for us, for all the work that they are doing as well as hear from them on their challenges and needs so that we can how best we can resolved them.\n\n“The crop of leadership we have in the military are working hand in hand together and have resolved to fight this war diligently and they are working as a family committed to see the end of the menace in no distant future, “Badaru added.\n\nEarlier at the Government House Maiduguri during his courtesy call on Governor Zulum, the Minister commended Zulum for his support to the military, saying, “we appreciate all the support, sometimes you risk your life in supporting and giving courage to our personnel in the frontline”.\n\nIn his remark, Governor , Zulum appreciated the visit of the defence delegation and said the joint operational visit of the defence high powered team to the theatre Command Headquarters North East Maiduguri was a clear testimony of the commitment and determination of Defence Ministers and the Service Chiefs towards achieving lasting peace in the State.\n\nAccording to him. the security situation in the state has actually improved tremendously as a result of the successes recorded by the troops.comoare to the past.\n\nZulum, however, warned against sensational security reportage by the media, noting that the insurgents do take the advantage of such information to make attacks on innocent villagers and farmers in the rural areas despite the fact that they have been degraded.\n\n“Within the last two weeks, I have been to the nooks and crannies of the state and reports reaching me from stakeholders in these areas indicated that peace has returned in the state,” Zulum said.\n\nWhile commending the efforts and support of President Tinubu and the military for sustaining the improved security situation in the state, Zulum urged them to rid the state of the remnants of the Boko Haram terrorists.\n\n“The only way we can degrade their presence is continued and sustained military operations,” Zulum added.\n\nThe governor further said that about 160,000 insurgent fighters and their family members had surrendered sequel to the non kinetic effort of the military while soliciting for the support of the military in terms of manpower development to enable the state curtail trans-border small arms and light weapons proliferation from the neighbouring countries of Niger, Chad and Cameroon Republic the state is sharing international boundary with them.\n\n“We have insurgency in other part of the country but the security in the northeast is very important for the stability of the country because of the porous borders with Niger, Cameroon and Chad Republics.\n\n“We have to ensure that we don’t have safe haven for ISWAP in the northeast as the Sahel is now a major problem, ” Zulum said.\n\nDISCLAIMER\n\nThe OPINION / COLUMN is authored by independent contributors to the National Accord Newspaper. While contributors adhere to our editorial guidelines, they are not employed by the National Accord Newspaper. The perspectives and opinions expressed herein are solely those of the author and do not represent the views of the National Accord Newspaper or its staff.\n\nShare this:\n\nTweet\n\nPrint\n\n\n\nTelegram\n\nEmail\n\nWhatsApp\n\n\n\nLike this: Like Loading...\n\nShare this:\n\nTweet\n\nPrint\n\n\n\nTelegram\n\nEmail\n\nWhatsApp\n\n",
        "lang": "en"
    },
    {
        "title": "Why Nigeria’s forex crisis persists",
        "external_url": "https://dailytrust.com/why-nigerias-forex-crisis-persists/",
        "publication_author": [
            ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow",
            "Class",
            "Wp-Block-Co-Authors-Plus",
            "Display Inline",
            ".Wp-Block-Co-Authors-Plus-Avatar",
            "Where Img",
            "Height Auto Max-Width",
            "Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar",
            "Vertical-Align Middle .Wp-Block-Co-Authors-Plus-Avatar Is .Alignleft .Alignright",
            "Display Table .Wp-Block-Co-Authors-Plus-Avatar.Aligncenter Display Table Margin-Inline Auto"
        ],
        "publication_date": 1701573480000,
        "description": "",
        "text": "Nigeria’s foreign exchange volatility may linger for a while due to low crude oil production and limited foreign exchange inflows into the country, Daily Trust…\n\nNigeria’s foreign exchange volatility may linger for a while due to low crude oil production and limited foreign exchange inflows into the country, Daily Trust on Sunday reports.\n\nThe development is weighing heavily on the financial standing of Nigeria and its international reputation as a country that is ready for businesses despite the recent assurances by President Bola Ahmed Tinubu that all bottlenecks to investment had been removed.\n\n“Africa has moved beyond the false past notions of business disincentivisation and poor adherence to the rule of law. We now fully recognise the nexus between the inflow of investor money and the sanctity of contracts,” Tinubu recently said during his visit to Germany.\n\nBut key to boosting investors’ confidence is the seamlessness in repatriation, which every investor doing business in Nigeria would be desirous of. In addition, foreign businesses would see a business environment with strong foreign exchange liquidity and one that guarantees not only a return on investment but predictability of returns.\n\nAs at last week, foreign businesses were said to have lost over N900 billion due to naira devaluation in 2023 alone.\n\nForex crisis: Declare Cashless Policy, Investment Analyst tells FG\n\nDollar crisis: 313 Bureau de Change asks FG to set up forex committee\n\nDaily Trust on Sunday reports that Nigeria’s currency has suffered massive depreciation against the foreign currency. Exchanging officially at N800, it has recorded over 500 per cent depreciation in the last eight years. This was in addition to the debilitating inflation, which is now at 27 per cent.\n\nAt the heart of this is the liquidity challenge in the country’s forex market, which has seen the Central Bank of Nigeria (CBN) accumulating over $10 billion in forex forwards to commercial banks and businesses operating in Nigeria.\n\nThe effect has been much visible in the airline industry, earning Nigeria the notoriety of being the only country blocking the largest chunk of airlines’ $1.6bn blocked funds in Africa.\n\nThe International Air Transport Association (IATA) has been calling out Nigeria over the development, which is said to be responsible for the surge in airfares across international destinations as airlines had to adopt an anticipatory forex rate in pricing their tickets.\n\nBeside the foreign airlines, local carriers are also baring the pangs of forex scarcity, leaving their aircraft stranded abroad while incurring huge demurrage on a daily basis.\n\nAzman Air, for instance, has three of its aircraft stranded abroad. Manufacturers are unable to access foreign exchange to import raw materials. The president of the Pharmaceutical Society of Nigeria (PSN), Prof Cyril Osifo, told our correspondent that prices of drugs were on the increase because of the high forex price to import Active Pharmaceutical Ingredients (APIs). He said it was high time Nigeria boosted domestic production.\n\nWhy Nigeria’s crude export not translated into forex liquidity\n\nAn analyst, Babatunde Adeniji, said Nigeria’s Letters of Credit had become mere papers to foreigners as they no longer honoured them in doing business with Nigerian companies.\n\nThe National Security Adviser, Mallam Nuhu Ribadu, recently opened up that the Tinubu administration inherited a “bankrupt country” from his predecessor.\n\n“We are facing very serious budgetary constraints. It is okay for me to tell you. It is fine for you to know. We have a very serious situation.\n\n“We have inherited a very difficult country, a bankrupt country, to the extent that we are paying back what was taken. It is serious.\n\n“But this administration is doing its best to meet our requirements, including that of the armed forces,” Ribadu said at the Chief of Defence Intelligence Annual Conference, hinting that the present administration is “paying back what was taken.”\n\nOur correspondent reports that Nigeria’s public debt hit N87trn in the second quarter of 2023, up by 75 per cent from Q1 2023.\n\nThe Debt Management Office (DMO) said Nigeria’s total public debt rose to N87.38trillion in the second quarter (Q2) of 2023, recording an increase of 75.29 per cent. It was worsened by what experts call abuse of Ways and Means, which represents the loans taken directly from the CBN Act, and must not exceed five per cent of the previous revenue. But this was largely abused, prompting the Senate to quickly amend the act to increase it to 15 per cent.\n\nFor the 2024 budget, the federal government has proposed N26.01trn, with N8.25trn for debt servicing and other parameters as explained by the Minister of Budget and National Planning, Abubakar Bagudu.\n\n“The assumptions include the oil price benchmark, which I said for 2024, we were assuming $73.96, oil production of 1.7 8million barrels a day at the exchange rate of $700.\n\n“Then the inflation of 21 per cent and gross domestic product (GDP) growth rate of 3.76 per cent. The aggregate expenditure is estimated at N26.01trn for the 2024 budget, which includes statutory transfers of N1.3trn, non-debt recurrent expenditure of N10.26trn, debt service estimated at N8.25trn, as well as N7.78trn being provided for personnel and pension costs.\n\n“Debt service increased because N22.7trn Ways and Means was securitized, meaning that it became a federal government debt at 9per cent.”\n\nAnalysts, however, said the parameters might not align with the current macroeconomic realities in the country.\n\nInflation has crossed 27 per cent; oil production is currently at about 1.3m barrels a day, lower than the OPEC Quota and the exchange rate, which is hovering around N800/$.\n\nCrude swap, a serious trap\n\nThere are reports that Nigeria has entered into crude oil swap deals running into billions of dollars by previous governments.\n\nApart from the fact that Nigeria is not meeting the OPEC quota of 1.7m barrels per day, the ones being supplied currently are said to have been paid for in crude oil swap deals, which the Nigerian National Petroleum Company Limited (NNPCL) has promised to terminate.\n\nBut data from the Nigeria Extractive Industries Transparency Initiative (NEITI) indicated that the NNPCL exchanged crude oil valued at N2.6trn for refined petroleum products in 2021 under the Direct Sale Direct Purchase Agreement (DSDP).\n\nThe NNPC allocated a total of 98.92 million barrels of crude oil valued at $7.11bn (N2.73tn) for the local market in 2021. However, no crude was delivered to any of the local refineries in 2021.\n\n“Instead, the NNPC used 95.25 per cent of this crude for crude exchange for products at the international market under the DSDP arrangement, while 4.75 per cent was sold at the international market.\n\n“This may be due to the fact that none of the refineries were operational in 2021. The sum of N2.23tn ($5.85bn) was the actual domestic crude sales receipts in 2021, out of which the sum of N1.64tn ($4.30bn) represents 2021 sales receipts, while the sum of N588.68bn ($1.55bn) relates to settlement of prior year receivables,” the report stated.\n\nThe report also showed that the NNPCL lifted and exported a total of 24.84 million barrels of crude oil valued at $1.70bn on behalf of the federation in 2021.\n\nIt stated that the sum of $1.58bn was traced to the respective bank accounts as the actual sales receipt in 2021, of which the sum of $1.55bn represents 2021 sales receipts, while the sum of $24.32m relates to settlement of prior year receivables.\n\nWhile experts said this was not new in the international crude oil market, they said Nigeria must be able to ramp up crude oil production to service the local refineries, which are expected to come on stream in a few weeks time like the Dangote Petrochemical Refinery, the Port Harcourt Refinery and other refineries, which the federal government has promised to revive, as well as the tens of modular refineries being licensed across the country.\n\nAn oil and gas expert, Jasper Nwachukwu, said the crude oil market was a future market, which means that supplies of months to come must have been bid for by the prospective buyers.\n\nBut he said Nigeria was facing a forex shortage despite being an oil-producing state because of mismanagement.\n\nThe expert said the NNPCL, which should have been the saviour for Nigeria in terms of relieving the country in its present forex liquidity crisis, was also not “liquid.”\n\nNwachukwu said, “Crude oil is a future market. Oil of the coming months has already been sold to refineries; that is why eventually, if they can’t make it they have to declare a force majeure, but besides that, in the Nigerian context, I think the problem is that we are spending too much money on debt servicing. We have borrowed so much money during the last administration and we are expending almost 90 per cent of our incomes to pay for debt servicing.\n\n“Secondly, the NNPC is also not very liquid. They have to export cash calls from their JV partners. So these cash calls are coming from that same point, and most importantly of course is the issue of corruption, not knowing how much oil we are selling on a daily basis. You may know what you are producing but you don’t know how much is sold because part of it is stolen by oil thieves. Essentially, you can only guess and your guess work will turn out to be false.\n\n“Then we are also not able to meet our OPEC quota. We are short of our OPEC quota by almost 300,000 barrels a day, so that is also a huge amount of money you are going to get.\n\n“Until these characters in government find a way to spend less because they are also spending more than they are earning to maintain their lifestyle – buying SUVs of N150m, spending money to buy a yacht, and so on.\n\n“We are not earning the amount of money we should be earning from our oil, whatever we earn is used on servicing debts, and we are still borrowing more.”\n\n‘Govt running on life support’\n\nThe expert said the implication of not making enough money from the sale of crude oil is that the government cannot meet its obligations to the citizens.\n\n“At the end of the day, we will have a government that is not well conversant with what it’s supposed to do. The government is running on life support, like it is in an intensive care unit.\n\n“You want to be throwing money at every opportunity, even the ones that don’t need money,” he added.\n\nOn the solution, he said, “I can’t tell you what I think is the solution because I don’t know it myself. I don’t see forex coming down soon because it is a business for some highly placed government guys. They jack up their prices for the common man and they want it to go on.\n\n“There are refineries in Europe that need this oil; and you know refineries cannot shut down, so they are waiting for crude oil, and they are on 24/7. So it (advance crude oil sale) is an international way of doing business and not peculiar to only Nigeria. The little money we get is used to service debt and not to boost production.”\n\nDr Garuba Dauda, another oil and gas analyst and expert, said, “I am of the view that we need to do serious thinking on the forex liquidity thing. Why Nigeria’s situation seems to have defied solution is that we are facing artificial scarcity caused by hoarding. Privileged people are buying up dollars in circulation to secure themselves in the face of an increasing fall in the value of the naira. This practice is putting pressure on forex demand, thus compounding the situation.\n\n“Nigeria needs to address this issue by adopting the approach of Singapore. The approach is buying up the dollars that pass through the CBN, while denying speculators access to information about the country’s foreign/forex reserves,” he said.\n\nA chartered accountant and financial risk expert, Olabode Afolayan, said to optimise the forex earnings, citizens must cut their appetite for foreign made goods and also de-dollarise the economy.\n\nHe said importation was putting so much pressure on the naira, adding that there should be a change of mindset by Nigerians.\n\n“We need to have a change of mindset and be more patriotic. We need to buy more homemade items than importation. Although people are not buying Nigerian made things due to quality, we need to do what the Chinese did by going local.\n\n“We need to start producing our own televisions, our engineering students in the universities should be able to build local technology for this, we need to start manufacturing en masse,” he advised.\n\nHe also urged the government to clamp down on Nigerians hoarding the dollars as they are very powerful. The government is doing more to maintain momentum against the dollar.\n\n“We need not sabotage the effort of the government; and the government should talk to those hoarding the dollar because they are the big boys of Nigeria and not ordinary Nigerians.\n\n“When they hoard, the government should clamp down on them because the government is doing everything to make naira appreciate by clearing the forex backlogs and clearing trapped funds of foreign airlines. I learnt the government cleared some of this outstanding issue; hence the naira appreciated,” he added.\n\nForex liquidity rising – CBN\n\nThe governor of the Central Bank of Nigeria, Olayemi Cardoso, speaking in Lagos on recently during the 58th annual Bankers Dinner, said there was an improvement in the forex market liquidity.\n\nHe said, “We have already witnessed improvements in FX market liquidity in recent weeks as the market responded positively to tranche payments, which have been made to 31 banks to clear the backlog of FX forward obligations.\n\n“We have been subjecting these payments to detailed verification to ensure that only valid transactions are honoured. In a properly functioning market, it is reasonable to expect significant FX liquidity, with daily trade potentially exceeding $1.0bn.\n\n“We envision that with discipline and focused commitment, foreign exchange reserves can be rebuilt to comparable levels with similar economies.”",
        "lang": "en"
    },
    {
        "title": "SANDF Chief denies allegations of a secret rogue unit but questions remain",
        "external_url": "https://www.defenceweb.co.za/sa-defence/sa-defence-sa-defence/sandf-chief-denies-allegations-of-a-secret-roque-unit-but-questions-remain/",
        "publication_author": [
            "Guy Martin",
            "Sam Basch -"
        ],
        "publication_date": 1701969299000,
        "description": "",
        "text": "Following media allegations of a secret SANDF “death squad” allegedly involved in kidnapping, torture and murder, the Chief of the SANDF, General Rudzani Maphwanya, emphatically denied that such a unit exists.\n\nAt a media briefing on Thursday 7 December, Maphwanya termed the allegations published over several weeks in the Daily Maverick by civil society organisation Open Secrets as “fabrications.” He said the SANDF viewed the allegations in the most serious light as they have a potential to damage the image and reputation of the defence force.\n\n“All matters raised in these reports are of a serious nature and one would have expected that those who have such information together with their sources have an obligation to report such crime to law enforcement authorities,” he said.\n\nIn his prepared statement, Maphwanya referred to some incidents that featured in the Open Secrets exposé. These include the recovery of assault rifles and pistols stolen from the SA Army Engineer Formation in December 2019 and the abduction of an individual at the Mall of Africa. Both these incidents are before the court and “the SANDF cannot comment” on the matters.\n\nAccording to Open Secrets, some Special Forces (SF) operators were seen on surveillance footage at the Mall of Africa where alleged Islamic State financier Abdella Abadiga and his bodyguard were kidnapped. Three weeks earlier, in December 2022, the same luxury car seemingly belonging to the SANDF Special Forces was present when the sanctioned Russian ship Lady R off-loaded cargo in Simon’s Town.\n\nOpen Secrets also alleged that a civilian was tortured to death during the interrogation into the stolen assault rifles.\n\nThe SANDF did establish a Board of Inquiry headed by Brigadier General John Moorhouse to investigate complaints of alleged criminal activity, corruption, and abuse of office in the defence force. The final report was handed to the chief of the SANDF in September 2023.\n\nThe opposition Democratic Alliance (DA) Shadow Minister of Defence and Military Veterans Kobus Marais insists the findings should be tabled in Parliament and made public.\n\nAs part of the top-ranking panel at the media briefing, Lieutenant General Michael Ramatswana, SANDF Chief of Corporate Staff, said the Moorhouse Board of Inquiry is an internal tool, part of an on-going process. “The Board of Inquiry was convened without any pressure, and it will be concluded without pressure from anybody.”\n\nLieutenant General Thalita Mxakato, SANDF Chief of Defence Intelligence, added the Board of Inquiry dealt with a myriad of issues, not only those reported on in the media, and its recommendations are being considered by the Chief of the SANDF “who is applying his mind.”\n\nMarais is of the view that releasing the report is in the public interest, “because some of the victims of torture at the hands of rogue SANDF unit were civilians, whose cases have not been properly investigated and the perpetrators brought to book.”\n\nMarais said the alleged rogue unit, comprising the Special Forces Brigade, the Military Police, Defence Intelligence and Defence Legal Services were “operating with impunity and have raised concerns of a large-scale criminal conspiracy within the SANDF.”\n\nMaphwanya denied such criminality in the SANDF, saying the Special Forces operate within the law. “We can state clearly without any ambiguity that the defence force operates in a constitutional and democratic state,” he affirmed.\n\n“Like any other government department, the defence force can be scrutinised for anything that might seem to be going against the Constitution and the Bill of Rights, and that must be done within the framework of openness and transparency.”\n\nHe regarded the media as part of societal structures, which can act as a “force multiplier” to keep South Africa’s people well informed by reporting objectively.\n\nThe message that the media should convey is one of hope, that the SANDF is the country’s “last line of defence.” He said the SANDF always acts in the best interest of the people and is a guarantor for all other activities in the country. “Our role is to protect South Africa; we would not be derailed by anything, despite cuts and budgetary constraints.”\n\nIn this regard, he referred to President Cyril Ramaphosa, Commander in Chief of the SANDF, who is on record as saying the “de-budgeting of the defence force must come to an end.”\n\n“The allegations of torture are indeed worrying, and this is not good for public confidence in the defence force,” Maphwanya stated. “For the record, there are no military squads in the defence force that exist to carry out acts of torture and murder for whatever reasons.”",
        "lang": "en"
    },
    {
        "title": "Buhari’s Administration Bankrupted Nigeria, NSA Ribadu Declares",
        "external_url": "https://www.legit.ng/nigeria/1563608-buharis-administration-bankrupted-nigeria-nsa-ribadu-declares/",
        "publication_author": [
            "Segun Adeyemi"
        ],
        "publication_date": 1699956055000,
        "description": "",
        "text": "The federal government of Nigeria has revealed that the country is currently in tight economic distress\n\nNuhu Ribadu, the national security adviser to President Bola Tinubu, confirmed this development on Monday, November 13\n\nRibadu revealed that the previous administration of ex-President Muhammadu Buhari bankrupted the country's treasury\n\nLegit.ng journalist Segun Adeyemi has over 9 years of experience covering political events, civil society, courts, and metro\n\nFCT, Abuja - The National Security Adviser (NSA), Mallam Nuhu Ribadu, has revealed that Nigeria was financially depleted during the administration of former President Muhammadu Buhari.\n\nIn the first official statement regarding the government's finances after Buhari's eight-year tenure, Ribadu, speaking at the Chief of Defence Intelligence Annual Conference on Monday, November 13, stated that the government led by President Bola Tinubu inherited a country in dire financial straits, describing it as a \"bankrupted country.\"\n\nNSA Nuhu Ribadu said security had improved drastically since the inception of the new administration. Photo Credit: Arewa Business Hub\n\nSource: Twitter\n\nRibadu highlighted that the current administration is working to recover what was taken or stolen during the previous government.\n\nWhile he didn't explicitly say the nation was pillaged, he strongly implied that the treasury was emptied.\n\nAs reported by This Day, Ribadu said:\n\n“We have inherited a very difficult country, a bankrupt country to the extent that we are paying back what was taken. It is serious.\n\n“But this administration is doing its best to meet our requirements including that of the armed forces.”\n\nRibadu hailed improved security in Nigeria\n\nDespite these financial challenges, Ribadu acknowledged a significant improvement in the country's security situation.\n\nHe said:\n\n“Things have changed. Things are changing. You may not be reading it but things have changed. You have given live back to the office of the NSA.”\n\nHe praised the defence attachees for their commendable efforts and encouraged them to continue their work.\n\nAccording to Ribadu, the defence attachee system fosters positive relationships between Nigeria and host countries.\n\nRibadu pointed out that the enhanced security measures have resulted in a substantial reduction in violent deaths from 1,200 to 100.\n\nNotably, he mentioned that there were no recorded deaths in Borno State, which was previously a battleground for insurgents.\n\nHe revealed that security forces successfully rescued 600 kidnap victims who had been in captivity for two years.\n\nCountering the assertions of Ribadu, an anti-terrorism expert, Dr Abubakar Sani dismissed the NSA's remark that security had improved in Nigeria.\n\nIn a chat with Legit.ng, Dr Sani said:\n\n\"I think he is not sincere because this government is simply reaping the benefits of the effort of the past government.\n\n\"New challenges have emerged under this new government, and the NSA and his team appear to be clueless.\n\n\"Look at the increase in the kidnap of students in Zamfara and Kaduna. As I am talking to you, farmers are forced to pay money to non-state actors in parts of Niger State before they can access their farms.\"\n\nTinubu orders withdrawal of police from VIPs' escort, gives other directives\n\nMeanwhile, President Bola Tinubu has ordered the immediate withdrawal of police personnel from VIP security nationwide.\n\nThe minister of state for police affairs, Imaan Suleiman-Ibrahim, disclosed the president's directive at a two-day management retreat of the ministry.\n\nAccording to Ibrahim, the ministry would carry out the president's directive irrespective of how stringent it could be.\n\nSource: Legit.ng",
        "lang": "en"
    },
    {
        "title": "Group Calls For Buhari’s Arrest, Prosecution By ICC After NSA Revealed Nigeria Is ‘Bankrupt’",
        "external_url": "https://thewhistler.ng/group-calls-for-buharis-arrest-prosecution-by-icc-after-nsa-revealed-nigeria-is-bankrupt/",
        "publication_author": [
            "Wondrous Nnaemeka"
        ],
        "publication_date": 1699968317000,
        "description": "",
        "text": "612 SHARES Share Tweet [mc4wp_form id=33047]\n\nThe Human Rights Writers Association of Nigeria (HURIWA) on Tuesday commended the National Security Adviser, Nuhu Ribadu, for summoning the courage to admit that the Bola Tinubu-led federal government inherited a bankrupt country from the immediate past Muhammadu Buhari administration.\n\nEmmanuel Onwubiko, HURIWA’s National Coordinator, called for Buhari’s investigation, arrest, and trial by the International Criminal Court (ICC) in the wake of the NSA’s comments.\n\nAdvertisement\n\nRibadu, while speaking at the Chief of Defence Intelligence Annual Conference 2023, said the country was battling budgetary constraints having inherited a bankrupt country from the previous administration with about N46 trillion in debt to clear.\n\nHe said, “Fine, it is important for you to know that we have inherited a very difficult situation, literally a bankrupt country, no money, to a point where we can say that all the money we’re getting now, we’re paying back what was taken. It is serious!\n\n“But this administration is doing its best to meet our requirements, particularly the armed forces, and I believe that you leaders will be able to testify to that.”\n\nReacting, Onwubiko, in a statement on Tuesday, accused the Buhari administration of human rights violations, corruption, and economic mismanagement.\n\nAdvertisement\n\n“In her remarks during an interdenominational church service marking Nigeria’s 63rd Independence Anniversary, First Lady Oluremi Tinubu emphasized that her husband, President Bola Tinubu, is not a magician but is committed to fixing the country. She stated that the Tinubu administration inherited challenges from past administrations and is focused on repairing the damage without placing blame.\n\n“Also, in a recent speech at the Chief of Defence Intelligence Annual Conference 2023 in Abuja, Ribadu attributed the current financial crisis to the bankruptcy inherited by President Tinubu’s administration. While acknowledging budgetary constraints, Ribadu assured that the government is diligently working to ensure a robust defense management and security structure. He commended the armed forces for their commitment and positive changes under the current leadership”, HURIWA quoted.\n\nThe Rights group further alleged the last president’s tolerated terrorists and killings of civilians, adding it amounted to crimes against humanity that ought to be addressed and redressed by taking the former president to the international Criminal court in The Hague, Netherlands.\n\nHURIWA further alleged that militant groups led by Asari Dokubo engaged in human rights violations unabated.\n\n“Former militant leader Asari Dokubo revealed that his ‘private army’ was contracted by the Nigerian government to maintain security on the Abuja-Kaduna road and in various parts of the country.\n\nAdvertisement\n\n“Dokubo made this claim after a meeting with President Bola Tinubu in June 2023, criticizing the performance of the military in addressing insecurity.\n\n“He asserted that his men, stationed in different regions, played a crucial role in ensuring security, challenging the narrative that the military lacked sufficient armament,” Onwubiko added.\n\nHURIWA maintained that given the NSA’s disclosure and other human rights issues, Buhari should be investigated and prosecuted by the ICC.",
        "lang": "en"
    },
    {
        "title": "113 Generals Bow Out of Army as Defence Minister Assures of Prompt Payment of Pension – THISDAYLIVE",
        "external_url": "https://www.thisdaylive.com/index.php/2023/12/21/113-generals-bow-out-of-army-as-defence-minister-assures-of-prompt-payment-of-pension/",
        "publication_author": [],
        "publication_date": 1703116800000,
        "description": "",
        "text": "•Urges retirees to remain loyal to country, support democracy\n\n•Appreciate God, Lagbaja enjoins exiting senior officers\n\nKingsley Nwezeh in Abuja\n\n\n\n\n\nAfter 35 years of service to the nation, 69 Generals, 44 Brigadier Generals have bowed out of the Nigerian Army.\n\nSpeaking at a regimental dinner night organised in honour of newly retired and retiring Nigerian Army senior officers at the Armed Forces Officers’ Mess Asokoro, Abuja, Minister of Defence, Badaru Abubarkar, hailed the officers for their sacrifices and unwavering commitment to the nation’s stability and assured of the prompt payment of their pension.\n\nAt the event, one general, one lieutenant general, 67 major generals and 44 brigadier generals bowed out of the Nigerian Army, “after meritorious and dedicated service without blemish to the nation”.\n\nThe minister urged the retirees to take a break and reflect appropriately on the next phase of life, assuring them of government’s commitment to prompt payment of pensions of retired personnel.\n\nThe minister saluted the retirees and expressed the nation’s gratitude for their exemplary service, love for country and commended their spouses for their perseverance.\n\nHe charged members of the armed forces to remain loyal and sustain the culture of supporting democracy in Nigeria and across the shores adding that the disposition of the Armed Forces towards democracy had made it a shining example in West Africa and an influencer in the comity of nations.\n\nThe minister noted that the occasion provided Nigerian Army the opportunity to reflect on its service and profound dedication as demonstrated by the retired and retiring senior officers, adding that experiences and skills garnered while in service and respect for diversity, which has been their working principles throughout their career will provide them a veritable platform as they exit the service.\n\nHe noted that the federal government will continue to do all within its reach to improve the well- being of serving and retired personnel.\n\nSpeaking at the occasion, the Chief of Army Staff (COAS), Lt Gen Taoreed Lagbaja, enjoined the retired senior officers to appreciate God and the Nigerian Army for a successful sojourn in the ‘noble profession of arms’ and attaining the point of meritorious disengagement from active service.\n\nThe COAS congratulated and appreciated the wives and families of the retired senior officers for their patience and support, while holding the home front.\n\nLagbaja expressed gratitude to President Bola Ahmed Tinubu, the National Assembly and Defence Minister Badaru Abubakar for their untiring support to the Nigerian Army.\n\nHe reaffirmed the unalloyed loyalty of the NA to the president and the nation in the discharge of its constitutional roles in defending the territorial integrity of Nigeria.\n\nDelivering the vote of thanks on behalf of retired generals, Maj Gen Victor Ezugwu thanked the COAS for the honour accorded them, pledging that they will remain good ambassadors of the Nigerian Army, even in retirement.\n\nHighlights of the event were the presentation of record of service certificates and souvenirs to the retired and retiring senior officers and a loyal toast to the President, Commander in Chief of the Armed Forces of Nigeria, President Bola Ahmed Tinubu.\n\nDignitaries who graced the event include the Chairman Senate Committee on Army, Senator Abdulaziz Musa Yar’Adua, representatives of service chiefs and Inspector General of Police, immediate past Chief of Defence Staff, Gen Lucky Irabor (rtd), immediate past Chief of Army Staff, Lt Gen Faruk Yahaya (rtd) and Chief of Defence Intelligence, Maj Gen Parker Undiandeye.\n\nOthers include heads of security agencies and the President Nigerian Army Officers’ Wives Association (NAOWA) Mrs Mariya Lagbaja, amongst several others.",
        "lang": "en"
    },
    {
        "title": "Your pension will be paid, Defence Minister assures Army retirees",
        "external_url": "https://tribuneonlineng.com/your-pension-will-be-paid-defence-minister-assures-army-retirees/",
        "publication_author": [
            "Jacob Segun Olatunji"
        ],
        "publication_date": 1703086473000,
        "description": "",
        "text": "Defence Minister Mohammed Badaru Abubakar has hailed retired and retiring officers of the Nigerian Army for their sacrifices, unwavering commitment to the nation’s stability, and assured prompt payment of their pensions.\n\nThis was contained in a statement made available to defence Correspondents in Abuja by Director Army Public Relations Brigadier General Onyema Nwachukwu\n\nAccording to the statement, the Minister gave the assurance during a Regimental Dinner Night organised in honour of newly retired and retiring Nigerian Army senior officers at the Armed Forces Officers’ Mess Asokoro, Abuja.\n\nAt the event, one general, one lieutenant general, 67 major generals, and 44 brigadier generals bowed out of the Nigerian Army after meritorious and dedicated service without blemish to the nation.\n\nThe minister urged the retirees to take a break and reflect appropriately on the next phase of life, assuring them of the government’s commitment to prompt payment of pensions for retired personnel. The Minister saluted the retirees, expressed the nation’s gratitude for their exemplary service and love for the country, and commended their spouses for their perseverance.\n\nHe charged members of the Armed Forces to remain loyal and sustain the culture of supporting democracy in Nigeria and across the shores, adding that the disposition of the Armed Forces towards democracy had made it a shining example in West Africa and an influencer in the community of nations.\n\nThe minister noted that the occasion provided the Nigerian Army with the opportunity to reflect on its service and profound dedication as demonstrated by the retired and retiring senior officers, adding that the experiences and skills garnered while in service and respect for diversity, which have been their working principles throughout their careers, will provide them with a veritable platform as they exit the service.\n\nHe added that the federal government will continue to do all within its reach to improve the well-being of serving and retired personnel.\n\nSpeaking at the occasion, the Chief of Army Staff (COAS), Lieutenant General Taoreed Lagbaja, enjoined the retired senior officers to appreciate God and the Nigerian Army for a successful sojourn in the ‘noble profession of arms’ and attaining the point of meritorious disengagement from active service.\n\nThe COAS congratulated and appreciated the wives and families of the retired senior officers for their patience and support while holding the home front.\n\nGen. Lagbaja expressed gratitude to President Bola Ahmed Tinubu, the National Assembly, and Defence Minister Badaru Abubakar for their untiring support of the Nigerian Army. He reaffirmed the unalloyed loyalty of the NA to the President and the nation in the discharge of its constitutional roles in defending the territorial integrity of Nigeria.\n\nDelivering the vote of thanks on behalf of the retired generals, Major General Victor Ezugwu thanked the COAS for the honour accorded them, pledging that they will remain good ambassadors of the Nigerian Army even after retirement.\n\nHighlights of the event were the presentation of record service certificates and souvenirs to the retired and retiring senior officers and a loyal toast to the President, Commander in Chief of the Armed Forces of Nigeria, President Bola Ahmed Tinubu.\n\nDignitaries who graced the event include the Chairman Senate Committee on Army, Senator Abdulaziz Musa Yar’Adua, representatives of Service Chiefs and Inspector General of Police, immediate past Chief of Defence Staff, General Lucky Irabor (rtd), immediate past Chief of Army Staff, Lieutenant General Faruk Yahaya (rtd) and Chief of Defence Intelligence, Maj Gen Parker Undiandeye, Heads of Security Agencies and\n\nthe President of the Nigerian Army Officers’ Wives Association (NAOWA), Mrs. Mariya Lagbaja, amongst several others.\n\nYOU SHOULD NOT MISS THESE HEADLINES FROM NIGERIAN TRIBUNE\n\nHow I helped Peter Obi overcome impeachment plot as Anambra governor — Sowore\n\nSelf-styled human rights activist, Omoyele Sowore has revealed an age-long secret about Peter Obi, the Labour Party presidential candidate in…\n\nYuletides: Low-key Christmas looms as poultry birds price rise than last years’\n\nIn less than 10 days to Christmas, the price of poultry birds in Ibadan is projected to be higher than last year mostly because of…\n\nComedian Mark Angel apologises over Emanuella’s viral dance video\n\nNigerian comedian Mark Angel has issued an apology following the circulation of a viral video featuring his…\n\nI learnt about the use of human head for money rituals on Facebook —Man who beheaded OAU student in Abeokuta\n\nA 35-year-old suspect, Akeem, who was arrested by detectives in Ogun State Police Command after…\n\nTop 13 facts about Buhari at 81\n\nAs he marks his 81st birthday on Sunday December 17th, roughly six months after the completion of his two terms as…\n\nCAF crowns Nigeria’s Osimhen African Player of the Year\n\nSuper Eagles striker, Victor Osimhen, has been crowned the African Player of the Year 2023 by the Confederation of…",
        "lang": "en"
    },
    {
        "title": "VP Shettima holds peace townhall meeting with Plateau leaders, stakeholders",
        "external_url": "https://tribuneonlineng.com/vp-shettima-holds-peace-townhall-meeting-with-plateau-leaders-stakeholders/",
        "publication_author": [
            "Kehinde Akintola"
        ],
        "publication_date": 1703758179000,
        "description": "",
        "text": "Vice President Kashim Shettima on Thursday paid a condolence visit to Victims of Bokkos and Barkin Local Government Areas of Plateau State who were attacked by unknown gunmen.\n\nNo fewer than 70 people were killed during the attack which occurred on Christmas Eve.\n\nAccording to a statement issued by the Head of Press for the National Emergency Management Agency (NEMA), Mr. Manzo Ezekiel, the Vice President held a Town Hall meeting with various stakeholders where he appealed to them to help promote peace for harmonious coexistence and development of the State.\n\nHe said: “In furtherance of the Federal Government’s unwavering commitment to support persons and communities affected by the recent violent attacks in some communities of Bokkos and Barkin Local Government Areas of Plateau State, Vice President Kashim Shettima today visited the victims and assured of measures to provide them with succour and address the security challenges.\n\n“The Vice President, while addressing the displaced at a temporary camp in Bokkos, said President Bola Ahmed Tinubu was deeply concerned about sad incidents and directed security agencies to fish out those responsible to face wrath of the law.\n\n“He informed them that National Emergency Management Agency (NEMA) has been directed and prepositioned humanitarian items that will soon arrive the affected communities to provide them with succour.”\n\nThe Vice President commiserated with families of those that lost their lives, persons that were injured and displaced residents, while assuring them of the unwavering commitment of the Federal Government to ensure peace and security across the country.\n\nIn his remarks, Plateau State Governor Mr. Caleb Manasseh Mutfwang thanked President Bola Ahmed Tinubu and the Federal Government for commitments to support the affected persons and address the security challenges and especially the Vice President, Kashim Shettima for the visit to the State.\n\nGovernor Mutfwang who was also very happy about humanitarian items from NEMA, thanked the Director General Mustapha Habib Ahmed for the prompt response and said he will personally join NEMA team for equitable and fair distribution of the items.\n\nEarlier on arrival in Bokkos, the Director Planning Research and Forecasting, Dr. Onimode Bandele Abdullahi who represented the Director General in leading the NEMA team briefed the Vice President Kashim Shettima on details of the humanitarian items for the affected persons.\n\nThe NEMA team was also responsible for leading the Vice President’s entourage to the camp.\n\nThe Vice President was accompanied on the visit by the National Security Adviser Malam Nuhu Ribadu, Chief of Defence State General CG Musa and Chief of Defence Intelligence.\n\nWhile in Jos, he was joined by the General Officer Commanding (GOC) 3rd Division Nigeria Army and Heads of security agencies in the State.\n\nThe State Governor, Mr. Mutfwang led senior officials of the State and leaders of thoughts in receiving the Vice President. Among other senior indigenes present were former Governors Joshua Dariye and Simon Lalong, while the traditional rulers included the Gbong Gwom Jos and religious leaders.\n\nREAD ALSO FROM NIGERIAN TRIBUNE",
        "lang": "en"
    },
    {
        "title": "DHQ: Kinetic Approach to Fighting Terrorism No Longer Realistic – THISDAYLIVE",
        "external_url": "https://www.thisdaylive.com/index.php/2024/01/23/dhq-kinetic-approach-to-fighting-terrorism-no-longer-realistic/",
        "publication_author": [
            "Ima Ekanem",
            "Emmanuel Okonji",
            "Adeyinka Salami",
            "Kingsley Nwezeh"
        ],
        "publication_date": 1705968000000,
        "description": "",
        "text": "Kingsley Nwezeh in Abuja\n\n\n\n\n\nThe Chief of Defence Staff, Gen. Christopher Musa, yesterday, said the Armed Forces of Nigeria adopted the non-kinetic approach in the war against insurgency following the realisation that the desire to win the war using the kinetic option had become unrealistic.\n\nMusa said states now waged war through non-kinetic action.\n\nHe made the statements in Abuja while delivering a keynote address on “Psychological Operations and Strategic Communication for National Security,” at an event organised by the Defence Intelligence Agency (DIA).\n\nThe forum focused on the theme, “Winning Hearts and Minds for National Cohesion and Development.”\n\nRepresented by Director, Training, Defence Headquarters, Rear Admiral Matthew Daupreye, the defence chief said using a non-kinetic approach in the fight against insurgency and other threats to national security will help in winning over the hearts and minds of the people.\n\nMusa stated that warfare had gone beyond annihilating the adversary.\n\nHe stated, “Non-kinetic approach is the use of informational, psychological, diplomatic, economic, social and civil-military cooperation as part of instruments of national power to pursue national interests.\n\n“It involves collaborations between the military and civil actors to achieve national interest through the application of non-lethal force or means that are sub-lethal or not intended to be lethal to dispose of the enemy.”\n\nMusa stressed the need for greater inter-agency collaboration, in addition to psychological operations and strategic communication, to reduce acts of insurgency to the barest minimum.\n\nHe said a combination of conventional warfare, irregular warfare, terrorism and counter insurgency was asymmetric warfare waged by resistance groups, where you deliver forces or prevent the conventional force and economic intimidation in countries.\n\nEarlier, the Chief of Defence Intelligence, Maj Gen Emmanuel Undiandeye, highlighted the importance of psychological operations as a way of winning the war against insurgency.\n\nUndiandeye said the five-day programme, facilitated by the Defense Intelligence Agency and the Safe Neighbourhood Initiative, provided a unique opportunity and platform to understand the dynamics of psychological operations and strategic communications.",
        "lang": "en"
    },
    {
        "title": "Nigerian Military up-scaling use of soft power in counter-insurgency operations – CDS",
        "external_url": "https://dailypost.ng/2024/01/22/nigerian-military-up-scaling-use-of-soft-power-in-counter-insurgency-operations-cds/",
        "publication_author": [
            "Matthew Atungwu"
        ],
        "publication_date": 1705881600000,
        "description": "",
        "text": "The Chief of Defence Staff, Gen. Christopher Musa, says the military has up-scaled the use of hard and soft power in counter-insurgency operations to contain emerging and changing nature of adversaries.\n\nThe CDS said this while delivering a lecture titled, ‘Non-Kinetic Operations and the Nigerian Armed Forces’, at the opening of a national security course on ‘Psychological Operations and Strategic Communication (PSYOPS)’, on Monday in Abuja.\n\nThe course was organised by the Defence Intelligence Agency (DIA) with the theme, ‘Winning Hearts and Minds for National Cohesion and Development’.\n\nRepresented by Rear Admiral Daupreye Matthew, Director of Training, Defence Headquarters, the CDS stated that the use of non-kinetic efforts under Operation Safe Corridor resulted in the surrender of more than 2,000 Boko Haran members between 2016 and 2017.\n\nHe said 67 per cent of those who surrendered belonged to Abubakar Shekau faction of the insurgents.\n\nHe added that 1,543 repentant terrorists graduated from Mallam Sidi Camp in Gombe State, while 1,935 others were released from Bulumkutu Camp in Borno, between 2016 and 2022.\n\nAccording to the CDS, from July 2021 to May 4, 2022 alone, 51,828 terrorists and their family members surrendered, out of which 13,360 were fighters.\n\nMusa said 106,000 terrorists and their family members had so far surrendered in the North East.\n\nThe defence chief, however, asked for an assessment and content analysis of the security policies, as well as legal and operational frameworks.\n\nEarlier, the Chief of Defence Intelligence, Maj.-Gen. Emmanuel Undiandeye, said that the 5-day programme was organized to strengthen security experts’ understanding of the dynamics of psychological operations and strategic communication.\n\nHe described psychological operation and strategic communication as an integral element of modern warfare.",
        "lang": "en"
    },
    {
        "title": "Grounded Taipan helicopters already stripped for parts, Australia tells Ukraine",
        "external_url": "https://www.smh.com.au/politics/federal/grounded-taipan-helicopters-already-stripped-for-parts-australia-tells-ukraine-20240118-p5eycj.html",
        "publication_author": [
            "Andrew Probyn"
        ],
        "publication_date": 1705536000000,
        "description": "",
        "text": "Australia has refused Ukraine’s request to donate its retired fleet of Taipan helicopters, saying it is not feasible to return them to flying condition.\n\nIn a blow to Ukraine’s bid to bolster its air defences, Australia’s 45 Taipan MRH-90 aircraft will instead continue to be dismantled, stripped for spare parts and then buried in an undisclosed defence site.\n\nWith Defence Minister Richard Marles on leave, his stand-in, Pat Conroy, has been under pressure to explain why Australia is pursuing its so-called “disposal strategy” for the MRH-90s a month after being asked to donate them to the war against Vladimir Putin’s Russia.\n\nAn Australian Army MRH-90 Taipan in Queensland, before the fleet was grounded in September.\n\n“None of the aircraft are currently in flying condition and it is not feasible to return the aircraft to an operational state,” Conroy said.",
        "lang": "en"
    },
    {
        "title": "Betta Edu receives Cross River’s most outstanding public service award",
        "external_url": "https://tribuneonlineng.com/betta-edu-receives-cross-rivers-most-outstanding-public-service-award/",
        "publication_author": [
            "Kehinde Akintola"
        ],
        "publication_date": 1703868740000,
        "description": "",
        "text": "Nigeria’s Minister for Humanitarian Affairs and Poverty Alleviation, Dr. Betta Edu, has been conferred with an outstanding public service award by the Cross River State Government.\n\nAt the presentation ceremony held at Diamond Hall, Transcorp Hotels, Calabar, Governor Bassey Otu, who presented the Award to the Minister described her as ‘the jewel of the Crown’ and an outstanding daughter of Cross River state serving Nigeria at the National Level diligently.”\n\nThe Governor said Dr. Edu has distinguished herself in every assignment given to her, saying her contributions to the social, economic, and political development of Cross River State and Nigeria can not be overemphasized.\n\nHe described the Cross River State Recognition of Excellence awards as one of its kind to encourage those coming behind to emulate good leaders by contributing their quota to the state and nation-building.\n\nGovernor Otu said the grand reception was a new dawn in the history of Cross River State.\n\n“It’s the dawn of a new era in the history of Cross River State where eminent sons and daughters who are serving at the federal level in their different capacities are recognized.\n\n“They have been part of the state development agenda with distinguished human resources that has put the state growth trajectory at the national level.\n\n“The essence of the award is to add value and encourage others to render selfless service to Cross River State and Nigeria.\n\n“Dr Betta is our ‘Jewel of the Crown’ from Cross River State. She is a Cross River state export to the world. She has been making the state proud, and we are proud of what she’s doing at the center and for being an illustrious daughter of Cross River State and for your commitment to nation-building, you are recognized,” Governor Otu added.\n\nGovernor further said that “the unity of Cross River State is sacrosanct and place uppermost in this government which is a people-first Government because everybody is a stakeholder in the affairs of the state irrespective of religion, tribes, and ethnic differences.\n\nHe thanked President Bola Tinubu for appointing great Cross Riverians into strategic places in Government at the National, reassuring him that he would see the difference as Cross Riverians are hard workers.\n\nResponding, the Minister described the award as “Very Close to My Heart and a challenge to do more in reducing poverty and humanitarian crises in Nigeria, in line with President Tinubu’s Renewed Hope Agenda.\n\n“I dedicate this award to all Nigerians who are facing humanitarian challenges and assure them that the solution is here under President Tinubu’s. The President’s commitment to lifting millions of Nigerians out of poverty is unprecedented.\n\n“I want to most respectfully appreciate Mr. President for giving me this opportunity to serve at the national level. The same appreciation goes to my dear Governor, His Excellency Senator Bassey Edet Otu for organizing this award and for all the support,” Dr. Edu further said.\n\nOthers who received the distinguished service awards include Justice of the Court of Appeal, Justice Jane Inyang, Minister for Sports, Senator John Owan Enoh, Chief of Defence Intelligence, Major Gen. Emmauel Udiandeye, and six serving Assistant Inspector-General of Police who are indigenes of Cross River state.\n\nREAD ALSO FROM NIGERIAN TRIBUNE",
        "lang": "en"
    },
    {
        "title": "Ribadu And Buhari’s Bankrupt Country – THISDAYLIVE",
        "external_url": "https://www.thisdaylive.com/index.php/2023/11/21/ribadu-and-buharis-bankrupt-country/",
        "publication_author": [],
        "publication_date": 1700524800000,
        "description": "",
        "text": "REUBEN ABATI\n\nabati1990@gmail.com\n\nNuhu Ribadu, former Chairman of the Economic and Financial Crimes Commission (EFCC) now Nigeria’s National Security Adviser has been very vocal lately and there may well be many out there who may be wondering why the NSA, effectively the country’s official “father of secrets” should be so loud in the public arena. The NSA in any country is an ultra-senior adviser to the President, counsellor and confidant on both domestic and foreign policies. He is also a coordinator of the country’s security network. But there is no manual as to the style or method that any NSA brings to the office. It is simply a matter of character and choice. A National Security Adviser may choose to be in the background or opt to be vocal like Zbigniew Brzezinski of the United States, and Henry Kissinger who was both NSA and Secretary of State in his time. Kissinger was so public and vocal, he often appeared as if he was sharing power with President Richard Nixon. It looks like Nuhu Ribadu, the current National Security Adviser of Nigeria has chosen to be up-front and centre-stage and we must pay attention to what he says. In the last week alone, he has spoken twice and his statements are pungent. First, on November 13, at the annual Conference of the Chief of Defence Intelligence, Ribadu disclosed that Tinubu inherited “a bankrupt country.” The theme of the Conference was “Leveraging Defence Democracy and Regional Collaboration and Enhanced National Security”. He told his audience: “We are facing very serious budgetary constraints. It is okay for me to tell you. It is fine for you to know. We have a very serious situation… We have inherited a very difficult country, a bankrupt country to the extent that we are paying back what was taken. It is serious.”\n\nRibadu repeated more or less the same concerns, a few days later at the 19th Annual Conference of All Nigeria Editors in Uyo, Akwa Ibom State where in addressing the theme: “Stimulating Economic Growth, Technological Advancement: Role of the Media”, he called for the support of all Nigerians in eliminating all forms of insecurity. Earlier, at the Defence Chiefs Conference, he had praised the military for their patriotism which had led to a reduction in the spate of violent deaths, (from 1, 200 to less than 100 deaths), and increase in crude oil production – from 900, 000 barrels per day under Buhari to 1.7 million barrels per day under President Tinubu. He further said that the Bola Tinubu administration is committed to tackling the challenges that Nigeria faces.\n\nIt was intriguing to see Nuhu Ribadu, a former Chairman of the EFCC in the role of a social critic. But he wasn’t saying anything new or original. As far back as August 2016, Emir Sanusi Lamido Sanusi had raised the alarm that the Buhari administration was running the Nigerian economy aground. He even gave six recommendations which the government of the day ignored. Seven years ago, Sanusi II also warned the government about the dangers of using foreign reserves to keep the exchange rate at its official level in the market. He said the policy would never work! Nobody listened. In more recent days, he has since reminded everyone how Buhari mismanaged Nigeria. Like Sanusi II, President Olusegun Obasanjo in the last seven years has also consistently accused the Buhari administration of spending recklessly and terribly lacking the understanding of economics. Obasanjo has not changed his mind that indeed Buhari caused Nigeria’s current economic woes due to sheer recklessness. Obasanjo and Sanusi II are not alone. In August, Senator Adams Oshiomhole also said the same thing. Wale Edun, the Minister of Finance and Co-ordinating Minister of the Economy told us, also in August, that the Tinubu administration inherited a “bad” economy with an unacceptable high rate of unemployment and inflation: “We met a bad economy and the promise of Mr. President is to make it better,” he said.\n\nThe question to ask is where was Ribadu between 2015 and 2023 under Buhari? Where was Wale Edun? Or Adams Oshiomhole, and all the self-styled economists now advising this administration? In 2019, Nuhu Ribadu was in fact the Director of Field Operations for the APC Presidential Campaign. He helped to bring Buhari back to power. Oshiomhole also campaigned for him. Were they deaf then to the protests by Sanusi II and Obasanjo that Buhari and his team were destroying Nigeria’s economy? What Ribadu, Edun, Oshiomhole and other APC figures now criticizing Buhari are doing amounts to self-indictment. They were part of the problem. And since Ribadu insists that the truth must be told: at what point did he discover the truth by the way?, let it be known that President Bola Ahmed Tinubu lacks the right to moralize over the failure of the Buhari government. Did he not boast in the domain of the man he called the Eleyi of Ogun State (Governor Dapo Abiodun) that he, Tinubu was the Godfather who re-discovered Buhari, told him to stop crying, and made him President. Where was he when his chosen President was mismanaging the economy? What did he do? Now that he has taken back what he believes rightly belongs to him, he now blames the APC “John the Baptist” at the Presidential Villa.\n\nThere is this traditional folk wisdom that says you can help a man to get a job, but you cannot help him to discharge the responsibilities that come with the office, how he goes about it is his responsibility. It is just that we are shocked to hear from NSA Ribadu that Buhari left an empty treasury and ran the country aground. Buhari met a country debt profile of N12.6 billion in 2015, he left behind N87 trillion debt in 2023! By May 29, 2023, Nigeria’s inflation rate was 24%, the country was left in such a stranglehold that by October, headline inflation had accelerated to 27.33%. Food inflation is now 31.52%, unemployment rate is over 50%. Buhari left behind a chaotic foreign exchange system, a weak, badly devalued national currency, a compromised, over-politicized Central Bank, a huge debt overhang with the debt service to revenue ratio at 98%. One of the major reasons Nigerians supported Buhari was out of the belief that as a retired Army General and a former military Head of State, he would be able to deal with the challenges of terrorism, insurgency and banditry head-long. Ribadu who is a policeman has disclosed that he did not make much difference. Buhari adopted the strategy of pacifying and appeasing terrorists. His administration gave criminals “aso ebi.” He served them pepper soup and jollof rice, under the guise of rehabilitation. Till the last moment, the Buhari administration blamed the Jonathan administration that preceded it for all its woes. Even when it became clear that the duty of every administration was to improve on the efforts of its predecessor, and that eight years was more than enough to make a difference, Buhari and his people continued to blame Jonathan.\n\nBut here is what Karma has served: in September, Mr Wale Edun said on record that the Jonathan administration stabilized the Nigerian economy, and that the last time the Nigerian economy functioned was under Jonathan. Since he left office, President Jonathan who marked his 66th birthday yesterday, has remained relevant. His example continues to endure as a gold standard for democratic conduct and sportsmanship. He did not play “do or die politics”. In the face of the desperation of APC politicians who were threatening to burn down the country in 2015, if they were not allowed to take power, he decided to walk away, and said Nigeria was more important than anyone’s individual ambition. Other African leaders have followed in his footsteps: John Mahama of Ghana and George Weah of Liberia. He is today one of the most sought-after former Presidents in the world – leading election observation missions and intervening in peace building processes. I doubt if any international organization would require President Buhari’s services any time soon.\n\nI am in fact surprised that all the spokespersons of President Buhari who used to spit fire and brimstone have moved on. Notably. where is Alhaji Lai Mohammed, the former Minister of Information? He is now a Special Adviser to the Secretary General of the United Nations World Tourism Organization (UNWTO). He has moved on. Femi Adesina, Presidential Spokesperson is now Vice Chairman of The Sun newspapers. He is a Pastor of the Foursquare Gospel Church. He has also taken a traditional chieftaincy title from his home town, Oluomo of Ipetumodu, in addition to chieftaincy titles he already had from Abia (Ugo Mba 1 of Isieketa) and Enugu (Nwanne di Namba of Nmaku). Pastor, multiple-Chief Femi Adesina has also moved on. In 2022, President Buhari, trying to show that he was determined to address the economic challenges that the country faced, decided to set up a Presidential Economic Advisory Council (PEAC) to replace the Economic Management Team led by then Vice President Yemi Osinbajo. The committee was chaired by Dr. Doyin Salami of the Lagos Business School (LBS). Members included Bismarck Rewane, CEO Financial Derivatives, Chukwuma C. Soludo, former CBN Governor and now Governor of Anambra State, Professor Ode Ojowu, Dr Mohammed Sagagi, Dr Salisu Mohammed, Iyabo Masha: all first-class brains in economics and finance. In 2022, Salami was later made Chief Economic Adviser to the President. It took President Buhari four years to set up an Economic Advisory Council and seven years to appoint a Chief Economic Adviser. Obviously, he didn’t think the economy was important as Obasanjo alleged. Exactly what kind of advice did he receive? We may never know. His economic advisers have all melted into the folds of the Nigerian jungle where anything is possible. They are all probably waiting for the next Nigeria Economic Summit Group meeting where they can sound off about macroeconomics, scenarios, and those cliches with which textbook economics lobby for appointments. They too have moved on, in search of the next client. The only man who seems to be hanging around – our good friend Garba Shehu, also seems to have gone possum.\n\nAfter President Buhari left office on May 29, Garba Shehu stayed back to help manage communications. He was Senior Special Assistant (Media and Publicity) to President Buhari. He continues to function in that capacity in the private sphere, playing the role of an attacking midfielder in the Buhari team. Each time anybody tries to attack the Buhari record, he pounces, and provides an alternative view. One of the first pieces he wrote after May 29 was “One Hundred Days After Buhari”- an innovation in presidential communications. He has also had cause to tell us that Buhari brought Nigeria out of economic hardship, why Buhari could not remove fuel subsidy and that his boss is not responsible for Nigeria’s high inflation rate. When Mohammed Bello Adoke, SAN, former Attorney General of the Federation and Minister of Justice said in an interview with Adesua Giwa-Osagie that the Buhari administration was “the most incompetent in Nigerian history led by a set of political morons”, Shehu was quick to go after Adoke with expletives. But why has Garba Shehu not responded to NSA Nuhu Ribadu who has in fact outrightly accused the Buhari administration of theft? It has been a week since Ribadu delivered his double bombshell, and we have not heard from Garba Shehu. Is Shehu afraid of the NSA? Is he also aware that former Minister of Communications under Buhari, Adebayo Shittu has said on Channels TV: “In Buhari’s government, if you don’t go and meet him for the next four years, he would probably would not ask of you.” Engr. Shittu, he probably was not aware of your existence! Deal with that, please. However, I have seen, as of the time of this writing, a statement by Mallam Shehu on X (formerly Twitter) to the effect that President Muhammadu Buhari himself would appear on NTA Network, Monday, in an interview session titled “A Conversation with History.” The interviewer should ask him: how and why did he bankrupt Nigeria? His handlers should advise him not to come up with the jaded, contrived, response that he inherited a bad economy, which has been exposed as a blatant lie by those who should know.\n\nThis is where the Tinubu administration seems to be different. Whereas the Tinubu team has been saying that Buhari ruined the Nigerian economy because he was the perfect clueless leader, they have also been forthright in saying that Tinubu is determined to correct whatever may have gone wrong. That is leadership. That is accountability. That is courage. In Mecca, Saudi Arabia, a week ago, Tinubu said yes, he inherited liabilities but he also inherited assets. But “we do not make any excuses”. That is what Nigerians want – a leader who would “not make any excuses”. Buhari and his team spent eight years giving one excuse or the other. Throughout, they blamed President Jonathan, and hounded his team. At other times it was COVID-19. Or the President’s health. Or the Russia-Ukraine war. They even blamed the weather! Meanwhile, they abused Ways and Means and broke the law. Tinubu says he will make a difference. We expect him to do so.\n\nIt is not enough however, for the National Security Adviser to tell us that Nigerians “face a serious situation” and that “we are paying back what was taken”. If indeed, it is fine for us to know as he says, then he has to come out with the whole truth and nothing but the truth. The country’s NSA cannot afford to sound like a social media commentator. He must back his claims with concrete evidence. For acknowledging the right of the people to know, can he please tell us: who took what away? How much was taken away? How much are we paying back? How much have we paid back so far? Who are those persons responsible for bankrupting Nigeria? By making the statements he made in Abuja and Uyo, he faces the test of transparency and accountability. Full disclosure cannot be a threat to national security. Having brought the matter to the public domain, the NSA is obliged to tell us more.\n\nThe major thing we know for now is the repeated disclosure by the Coordinating Minister of the Economy that Nigeria can no longer borrow to fund budget deficit, and that it would be unwise to borrow more when debt service to revenue ratio is 98%, and the budget as a percentage of GDP is 10%. Edun thinks the country should focus more on revenue generation through infrastructure. He was accompanied to the Joint Senate Committee by Zach Adedeji, Chairman of Federal Inland Revenue Service and Ms. Patience Oniha, Director-General of the Debt Management Office (DMO). Patience Oniha? Yes, the same Ms. Oniha who used to tell us that there is nothing wrong with borrowing. Madam has started singing a new song…Oh la la…",
        "lang": "en"
    },
    {
        "title": "",
        "external_url": "https://www.premiumtimesng.com/news/more-news/652887-retirement-nigerian-army-honours-113-generals.html",
        "publication_author": [],
        "publication_date": null,
        "description": "",
        "text": "",
        "lang": "en"
    },
    {
        "title": "We Inherited A Difficult Situation, A Literally Bankrupt Country – NSA Nuhu Ribadu",
        "external_url": "https://www.tekedia.com/we-inherited-a-difficult-situation-a-literally-bankrupt-country-nsa-nuhu-ribadu/",
        "publication_author": [
            "Samuel Nwite",
            "Please Enter Your Name Here"
        ],
        "publication_date": 1699973313000,
        "description": "",
        "text": "Nigeria’s former anti-corruption czar and National Security Adviser, Nuhu Ribadu, has criticized the immediate past administration of Muhammadu Buhari, accusing it of leaving the country in a dire financial state before leaving power in May.\n\nRibadu made these remarks during the Chief of Defence Intelligence Annual Conference 2023 held in Abuja, where he addressed leaders on the theme, “Leveraging Defence Diplomacy and Effective Regional Collaboration for Enhanced National Security.”\n\nIn his speech, Ribadu did not mince words, stating, “Yes, we’re facing budgetary constraints. It is okay for me to tell you. Fine, it is important for you to know that we inherited a difficult situation, literally a bankrupt country, no money, to a point where we can say that all the money we’re getting now, we’re paying back what was taken. It is serious!”\n\nHowever, Ribadu reassured the audience that despite the financial challenges, the Federal Government was committed to ensuring robust and viable defense management and security apparatus. He asserted, “This administration is doing its best to meet our requirements, particularly the armed forces, and I believe that you leaders will be able to testify to that.”\n\n“I assure you that the Federal Government will not rest on its laurels in ensuring a robust and viable defense management and security apparatus to address contemporary challenges even in the face of enormous budgetary constraints.”\n\nThe conference, attended by key figures including the Minister of Defence, Abubakar Badaru; Minister of State, Bello Matawalle; Permanent Secretary in the Defense Ministry, Ibrahim Kana; and the Chief of Defence Staff, addressed crucial issues surrounding national security and defense.\n\nDespite the pledge to navigate through financial constraints, questions have arisen about the continuity of fiscal responsibility within the present administration. Critics have pointed out the lavish spending patterns reminiscent of the previous regime. The focus has shifted to Bola Tinubu’s administration, alleging a parallel trajectory in financial management.\n\nIn September, reports surfaced that Tinubu spent over $500,000 during a luxurious five-day stay in a New York hotel. Furthermore, there are concerns about the president’s proposed expenditure of N13.5 billion ($16.2 million) for the renovation of official residences in Abuja and Lagos. Critics argue that this is an unnecessary allocation given the existing presidential mansion in Lagos, which is rarely used.\n\nThe supplementary budget of N2.17 trillion (about $5 billion) has drawn attention, particularly for including N1.5 billion for vehicles for the Office of the First Lady, an entity not constitutionally recognized. The budget also originally featured a controversial N5 billion yacht, which faced public backlash, leading the National Assembly to remove it from the allocation.\n\nAdditional allocations in the supplementary budget include N2.9 billion for Sport Utility Vehicles (SUVs) for the Presidential Villa and another N2.9 billion for replacing operational vehicles for the presidency.\n\nRenovations of the presidential and vice-presidential residences are also planned, with N4 billion designated for the president’s residence and N2.5 billion for the vice president’s residence. The proposed State House budget is N28 billion, with N12.5 billion allocated for the Presidential Air Fleet.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n",
        "lang": "en"
    },
    {
        "title": "Defence ministers, CDS, service chiefs on operational visit to Maiduguri",
        "external_url": "https://tribuneonlineng.com/defence-ministers-cds-service-chiefs-on-operational-visit-to-maiduguri/",
        "publication_author": [
            "Atiku Galadima"
        ],
        "publication_date": 1701181976000,
        "description": "",
        "text": "The Minister of Defence, Badaru Abubakar, and his counterpart for state, Bello Matawalle, accompanied by the Chief of Defence Staff and other service chiefs, arrived in Maiduguri on Tuesday to assess the security situation in the Theatre of Control and Command, Operation Hadin Kai, Maiduguri.\n\nThe Chief of Defence Staff (CDS), Gen. Christopher Musa, Chief of Army Staff (COAS), Lt.-Gen. Taoreed Lagbaja, Chief of Air Staff (CAS), Air Marshal Hassan Abubakar, Chief of Naval Staff, Vice Admiral Emmanuel Ogalla, and Chief of Defence Intelligence (CDI), Maj.-Gen. Emmanuel Undiandeye were part of the visit.\n\nThe minister and his team were at the Government House in Maiduguri, where he disclosed that the delegation was assigned by President Bola Ahmed Tinubu to visit the governor and people of Borno State.\n\n“We are also here to hear from the patriotic troops in the state about the progress made and what we need to do more of.\n\nHe assures that the visit will help bring the Boko Haram insurgency to an end in no distant time.\n\n“The Governor has advised us on what to do; he has given us a strategy.\n\nTogether, the Chief of Defence Staff and the army have agreed on what to do, and there is no delay.\n\n“I want to assure you that President Tinubu is willing to support us all through to see the end of this fight and see that peace returns and normal business resumes.\n\nAlso speaking, Governor Babagana Umara Zulum of Borno State sought the deployment of more military personnel to reach out to the enclaves of Boko Haram insurgents who refused to lay down arms in Borno and the northeast.\n\nZulum noted that the northeast theatre is critical to the security of the entire nation.\n\nHe said the porosity of Nigerian borders to the republics of Niger, Chad, and Cameroon in the northeast needs to be reinforced to prevent the infiltration of ISWAP and the proliferation of small arms and ammunition into the country.\n\n“We still need your support in the area of having more manpower in the state, which is very critical. Yes, we know we have a problem of insurgency in northern Nigeria, north-central Nigeria, and other parts of the north, but insurgency in the northeastern states is very critical to the security of the entire nation because of the porosity of our borders.\n\n“Borno State is sharing borders with the republics of Cameroon, Chad, and Niger, so we have to be sure that we don’t have safe heavens in Borno State; otherwise, the proliferation of small arms and ammunition will increase, and the presence of ISWAP will also increase as a result of the porosity of the Sahelian region. The Sahel region is our major problem.\n\n“Therefore, we want you to double your action with a view to clearing the shores of Lake Chad, the Sambisa Game Reserve, and also, last but not least, the Mandara Hills,” he said.\n\n“We are still soliciting the support of the Nigerian military to reach out to the enclave of the insurgents who are not ready to lay down arms.\n\nThis is very important because the only way that we will complete the degradation of the insurgents is by continuing military operations,” he said.\n\nHe explained that the shores of Lake Chad, which have a total arable land area of about 25,000 square kilometres, are very important to the people of Borno State.\n\nYOU SHOULD NOT MISS THESE HEADLINES FROM NIGERIAN TRIBUNE\n\nGAMA: Peter Obi bags Politician of the Year award\n\nThe event, themed “A Channel of Hope Where There is Despair,” celebrated individuals making positive impacts on…\n\nCatholic Priest remanded for raping, impregnating teenage girl in Anambra\n\nAn Awka Children, Sexual and Gender-Based Violence Court of Anambra State, has remanded a Catholic Priest, Rev. Fr. Nwaigwe Stephen to…\n\nDiscontent spreads over succession plots at Supreme Court\n\nAs Nigerians wait on the National Judicial Council (NJC) to make final pick for the Supreme Court bench, fresh claims have emerged to explain the lopsidedness in…\n\nI was forced to pay N1m, buy iPhone 14 Promax for marrying Sheila a virgin — Israel DMW\n\nDavido’s Logistics Manager, Israel Afeare, who is popularly known as Israel DMW, claimed that his estranged wife’s parents “forced” him to…\n\nHID asked monarch, other visitors to leave few minutes before death — Awolowo Dosumu\n\nAt the church service held at the in-house chapel of the Awolowo family house, Ikenne-Remo, Ogun State, Dr Awolowo Dosumu recalled how…\n\nBangbet Risk-free Starting: Nigeria’s Most Generous Betting Site Reveals\n\nThe world of online betting has been transformed by innovative platforms like Bangbet. With its user-centric design, the Bangbet app promises…",
        "lang": "en"
    },
    {
        "title": "Nigerian Army celebrates 113 retiring generals – Nigerian Observer",
        "external_url": "https://nigerianobservernews.com/2023/12/nigerian-army-celebrates-113-retiring-generals/?utm_source=auto-read-also&utm_medium=web",
        "publication_author": [],
        "publication_date": null,
        "description": "",
        "text": "The Nigerian Army hosted a grand dinner gala to honour 113 retiring generals in an event to commemorate their remarkable service to the nation.\n\nAmong the distinguished group were a full General, a Lieutenant General, 67 Major Generals, and 44 Brigadier Generals, individuals who either retired or were slated for retirement within the year.\n\nThe ceremony, graced by esteemed figures including retired Gen. Lucky Irabor, the immediate past Chief of Defence Staff, Lt.-Gen. Faruk Yahaya, former Chief of Army Staff, and retired Maj.-Gen. Samuel Adebayo, Ex-Chief of Defence Intelligence, stood as a testament to these senior officers’ 35 years of unwavering dedication to the nation.\n\nMinister of Defence, Muhammad Badaru, lauded the retiring generals for their extensive experience, exceptional skills, integrity, discipline, dedication, loyalty, and inclusive mindset. Badaru emphasized the pivotal role these attributes would continue to play in guiding the retired officers in their future endeavors. He urged them to consider entering politics, citing their potential to instill discipline and patriotism in governance.\n\nWhile expressing gratitude to the retiring officers, Chief of Army Staff, LT.-Gen. Taoreed Lagbaja, commended their honorable service and congratulated them on their meritorious disengagement from military duty. He extended heartfelt appreciation for their immense contributions to national security and wished them success in their retirement.\n\nMaj.-Gen. Jimmy Akpor, Chief of Administration (Army), underscored the significance of the dinner gala, stating its purpose was to pay tribute to the retiring generals for their unwavering commitment to the nation. He reiterated that such events were instituted by past Nigerian Army leaderships to ensure a memorable departure for retiring officers.\n\nIn an expression of gratitude on behalf of the retired generals, Maj.-Gen. Victor Ezugwu conveyed profound thanks to the Chief of Army Staff for the honor bestowed upon them. He assured everyone of their continued dedication to upholding the core values and ideals of the Nigerian Army, even in retirement.",
        "lang": "en"
    },
    {
        "title": "Cross River Gov. Otu honours 10 Nigerians for contributions to Nation building",
        "external_url": "https://www.tvcnews.tv/2023/12/cross-river-gov-otu-honours-10-nigerians-for-contributions-to-nation-building/",
        "publication_author": [],
        "publication_date": 1703782277000,
        "description": "",
        "text": "Ten notable citizens were honored with a lavish reception by Bassey Otu, the governor of Cross River State, for their contributions to the development of the country.\n\nChief of Defence Staff, General Christopher Gwabin Musa, and his spouse were among the guests at the event, which took place in Calabar, the state capital.\n\nOther attendees included the Deputy Governor, Mr. Peter Odey, and a few members of the national and state assemblies.\n\nOne of the “Defining moments in the history of Cross River State, which signalled the dawn of a new era in purposeful leadership, where the citizens little or immense contribution to nation building is recognized and rewarded accordingly,” according to Governor Otu, was the elevation of the award recipients.\n\nTo the Honourees, he said ,“There are social responsibility each of you owe the nation, state and the communities you live in to serve as role models in terms of mentorship and transformational leadership. You need to replicate the zeal in governance and patriotism in the service to the state and of course the nation,” Otu stressed.\n\nThe Governor urged all citizens of Cross River and other citizen residents in the state to forge a bond of unity that would entrench development and economic growth in every sector.\n\nA justice of the Court of Appeal, Justice Jane Inyang, who spoke on behalf of other honourees said, “We are thankful for this honour and privilege to serve our nation. We pledge to lift Cross River State high in our different capacities in service to the nation.”\n\nIn an interview, the Minister of Humanitarian Affairs and Poverty Alleviation, Dr. Betta Edu, who was one of the honourees said,“It is a beautiful thing to have the Cross River State Governor and the government honour its illustrious sons and daughters, who have been recently elevated. We thank President Bola Tinubu for the elevation he has given to sons and daughters of Cross River State and we want to assure him that we will work behind him to achieve success.”\n\nAnother awardee, the Nigerian Army Chief of Defence Intelligence, Major General Emmanuel Undiandeye said, “I thank the Nigerian President Bola Tinubu for the opportunity to serve our nation and Governor Otu for honouring his own brothers and sister. I also thank my boss, the Chief of Defence Staff and his dear wife, who inspite of his tight schedule decided to witness this event. We only promise that we will put in our best to ensure that there is peace across Nigeria.”\n\nAlso, the Minister of Sports, John Owan-Enoh stated, “It is often said that to him whom much is given, much is required. I think that it increases the sense of responsibility that all of us have; not just the responsibility all of us have in Abuja, but the responsibility we have towards Cross River State. The governor has emerged out of this event stronger and more powerful, and it is a demonstration of leadership on his part.”\n\nAwardees include the Justice of the Court of Appeal, Justice Jane Esienanwan Inyang, the Minister of Humanitarian Affairs and Poverty Alleviation, Dr. Betta Edu, the Minister of Sports, Senator John Owan-Enoh and the Chief of Defence Intelligence, Major General Emmanuel Undiandeye as well as the Assistant Inspector General of Police, Department of Finance and Administration, ICT, force headquarters, Abuja.\n\nOthers are Assistant Inspector General of Police Zone 9, Umuahia, Echeng Eworo Echeng; Assistant Inspector General of Police Zone 11, Osogbo, Paul Ojeka Odama; Assistant Inspector General of Police, Zone 11 Osogbo, Patrick Ogon Edung and Assistant Inspector General of Police, Emmanuel Effiom, Presidency as well as retired Assistant Inspector General of Police, Susan Horsfall.\n\nThe ceremony, which featured cultural dances, display by the Tourism Bureau Jazz band, Carnival front line girls and stand up comedy, climaxed with the presentation of plaques to the honourees.",
        "lang": "en"
    },
    {
        "title": "Exclusive: Top UK general says decision to publish Putin's Ukraine invasion plan was to 'pre-bunk' his lies",
        "external_url": "https://www.forces.net/ukraine/exclusive-top-uk-general-says-decision-publish-putins-ukraines-invasion-plan-was-pre-bunk",
        "publication_author": [],
        "publication_date": null,
        "description": "",
        "text": "Watch: General's plan was to 'pre-bunk' Putin's lies.\n\nOne of Britain's top military chiefs says the decision to publish Russian President Vladimir Putin's invasion plan of Ukraine on social media a week before he did it was to \"pre-bunk\" his lies. General Sir Jim Hockenhull, the Commander of Strategic Command, described the decision as \"brave\" and an attempt to get the \"truth out first\". The general decided to use social media to put intelligence information into the public domain, in advance of the Russian invasion in February 2022, in a way that had not been seen before. General Hockenhull said \"strategic patience\" is required as the conflict continues and the UK should be prepared for it to last for a considerable length of time.\n\nWatch: Who and what is the UK sending to Ex Steadfast Defender?\n\n\"Once that lie is out in the public domain, it has its own life and it's very difficult to get back under control. \"Rather than to debunk their lies, I was trying to 'pre-bunk' their lies and get the truth out first so that when they lied, it would be shown to be the hollow lie that it was. \"I think intelligence is changing in terms of how we use it. I'm kind of getting to the point, I think, of becoming more comfortable with it, however, doing interviews like this still feels slightly odd to a professional intelligence officer who spent the first 30+ years of my career making sure that I was never in the building when a journalist might be near, so I'm having to learn a few things as well.\"\n\nWatch: Ukraine's victory on the Dnipro River against 'insane' Russian counter attack.\n\nIt comes as a top Nato military official has warned that all-out war with Russia is a possibility within the next 20 years. Speaking after a meeting of Nato defence chiefs, Admiral Rob Bauer told reporters private citizens need to ready themselves for a potential conflict that would change their lives. Almost two years on from the Russian invasion, General Hockenhull told Forces News his memory of the moment: \"I think we knew quite a long way in advance that what we thought was going to happen. \"Of course, there was always a possibility that President Putin could have chosen a different path, but we were fairly sure from quite a distance out over what we thought would happen. \"I think I got home at about one o'clock in the morning. I'd been home for about an hour, I got a phone call to say that all the indications were that the attack was about to start, at which point I got back on my bicycle, cycled back into the Ministry of Defence and we went from there.\" Keep an eye out for the rest of General Hockenhull's interview, published on forces.net over the next week.\n\nRelated topics Ukraine\n\nJoin Our Newsletter",
        "lang": "en"
    },
    {
        "title": "Four Members reappointed to the Advisory Council on National Records and Archives",
        "external_url": "https://www.gov.uk/government/news/four-members-reappointed-to-the-advisory-council-on-national-records-and-archives",
        "publication_author": [],
        "publication_date": null,
        "description": "",
        "text": "Martin Howard\n\nAppointed for a four year term commencing 21 October 2023.\n\nMartin Howard is a retired UK senior security official. His last two postings in government were as Director for Cyber Policy and International Relations at GCHQ, focusing on strategic development and communication of cyber-security policies, and on cyber and intelligence cooperation with international partners; and Chief of the Assessments Staff in the Cabinet Office Joint Intelligence Organisation, analysing conventional and novel threats to national security and critical infrastructure.\n\nHe previously served as Assistant Secretary General for Operations in NATO, dealing with the alliance’s missions in Afghanistan, the Balkans, Libya, Iraq and on counter-piracy; as Director General Operational Policy in the Ministry of Defence; and as Deputy Chief of Defence Intelligence. He also worked in the Northern Ireland Office acting as Private Secretary to the Secretary of State and as part of the UK team that helped negotiate the Good Friday Agreement. Martin was appointed Companion of the Bath (CB) in 2007.\n\nDr Leon Litvack\n\nAppointed for a four year term commencing 21 October 2023.\n\nLeon Litvack is Professor of Victorian Studies at the Queen’s University of Belfast, Northern Ireland. He is the author of numerous scholarly publications, an authority on the life and works of Charles Dickens, and Principal Editor of the Charles Dickens Letters Project. Leon is also a freelance broadcaster for the BBC. He has held public appointments on National Museums Northern Ireland, Arts Council Northern Ireland, and the Northern Ireland Community Relations Council. He is a Director of Tobernagee Properties Ltd, and Charles Dickens Letters Ltd.\n\nHelene Pantelli\n\nAppointed for a four year term commencing 21 October 2023.\n\nHelene Pantelli is a qualified solicitor. She spent several years practising law with City law firms Freshfields Bruckhaus Deringer LLP and Travers Smith LLP, including a secondment to the legal team of a global financial institution. Helene’s experience focussed on all elements of commercial law, particularly private and listed investment funds, assisting clients with corporate transactions, corporate governance and regulatory matters.\n\nMost recently, Helene has worked at the Financial Ombudsman Service as a senior ombudsman, a statutory decision-maker responsible for resolving disputes between consumers and financial services providers, and Head of Practice for Investments and Pensions disputes. Helene led a division of ombudsman managers making legally binding decisions on complex and high value complaints with responsibility for technical matters and policy development for those complaints. She represents the Financial Ombudsman Service externally, speaking at events, liaising regularly with regulatory authorities, businesses and other key industry and consumer groups, recently in relation to high profile pension transfer matters. Helene represented the Financial Ombudsman Service on the government advisory group on social impact investing in the UK, the report for which – “Growing a culture of social impact investing in the UK” - was published at the end of 2017.\n\nDavid Rossington\n\nAppointed for a four year term commencing 21 October 2023.\n\nDavid Rossington CB is a former senior civil servant. He has worked for the Department for Culture, Media and Sport (DCMS), including as Finance Director and acting Director General, and other Government departments including what is now the Department for Levelling Up, Housing and Communities (DLUHC).\n\nSince stopping full time work, he has been a member of the Advisory Committee on National Records and Archives, to which he is being reappointed until October 2027, and currently serves as its Deputy Chair. He is also a Gambling Commissioner. He is Treasurer and Deputy Chair of a charity for veterans (Stoll), and Treasurer of an Oxford community arts charity (Arts at the Old Fire Station).\n\nDavid holds a degree in History and French from Oxford, a Masters in Public Policy from the Kennedy School, Harvard University, and an economics MSc from Birkbeck College, London. David took an accountancy qualification while a civil servant, although is no longer in practice.",
        "lang": "en"
    },
    {
        "title": "How Vessel With 200,000 Litres Of Stolen Crude Was Intercepted In Delta — ABN TV",
        "external_url": "https://abntv.com.ng/news/how-vessel-with-200000-litres-of-stolen-crude-was-intercepted-in-delta/",
        "publication_author": [
            "A Print Journalist With Vast Knowledge Of Political Developments",
            "In Nigeria. Passionate About Equity",
            "Fairness Through Robust Developmental Journalism.",
            "Please Enter Your Name Here"
        ],
        "publication_date": 1705345543000,
        "description": "",
        "text": "The Chief of Defence Staff (CDS), General Christopher Musa, in company of top officials of the Nigerian National Petroleum Company (NNPC) Limited on Monday, inspected a vessel caught with about 200,000 litres of stolen crude.\n\nThe vessel was arrested by a joint sting operation carried out by the Nigerian Navy and a private security firm Tantita Security Services.\n\nTwenty three suspects were caught on the vessels and the CDS assured the NNPCL and Nigerians that the Chief of Defence Intelligence would commence investigation immediately to unravel the criminals behind the act.\n\nSponsored\n\nThe Group Chief Executive Officer of the NNPCL, Mele Kyari, who declined comments on camera, decried the brazen level at which crude oil theft has escalated in the past few months despite the efforts being made to increase crude oil production in the country and jack up government revenue.\n\nThe vessel was caught off the coast of the Gbaramatu Kingdom area of Warri in Delta State and brought to the Oporoza area where investigation will begin.\n\nThe vessel is capable of carrying 350,000 of raw crude.",
        "lang": "en"
    },
    {
        "title": "British intelligence says Canada’s cyberspies are ‘at the head of the pack’",
        "external_url": "https://www.theglobeandmail.com/politics/article-canada-cybersecurity-five-eyes/",
        "publication_author": [
            "Marie Woolf"
        ],
        "publication_date": 1702292400000,
        "description": "",
        "text": "British intelligence has praised Canada’s electronic spy agency for being “nimble” and more advanced in some areas than they are, notably in cybersecurity where Canada is “at the head of the pack.”\n\nA five-year study by the British House of Commons’ Intelligence and Security committee, said Canada plays a “leading role” in cybersecurity in the Five Eyes intelligence partnership, which also includes Britain, the U.S., Australia and New Zealand.\n\nA report by the committee on international partnerships, using testimony from spy agencies and published this month, notes that Britain has adopted a Canadian system to guard against cyberattack.\n\nHowever, the findings follow a warning by The Business Council of Canada earlier this year that Canada risks being seen as a “weak link” by its allies if it does not move swiftly to mitigate economic security threats. The report, by a group representing Canada’s big employers, said there are “already troubling signs that Canada’s closest allies are taking note of our reluctance to confront growing security threats.”\n\nThe British committee, chaired by Conservative MP Sir Julian Lewis, had access to classified material and heard testimony from the heads of Britain’s intelligence agencies, including MI5, which covers domestic intelligence and national security; MI6, in charge of foreign intelligence; and Government Communications Headquarters (GCHQ), the electronic spy agency; as well as Britain’s defence intelligence arm.\n\nThe report said MI5 and MI6 “have strong working relationships with CSIS” and links between the two country’s spy agencies are “strong and trusting.”\n\nThe committee said evidence showed that the partnership between Canada’s cyberspies, the Communications Security Establishment (CSE), and GCHQ is “flourishing.”\n\nGCHQ testified before the parliamentary committee that “Canada is really nimble, and they’re very focused on cybersecurity.”\n\nThe report said GCHQ had noted “Canada’s mature and leading role on cybersecurity within the Five Eyes.”\n\n“Canada has been with us at the head of the pack on cybersecurity and our relationship on cybersecurity is extremely strong and deep,” GCHQ told the committee. “It’s the deepest of the Five Eyes actually and they have pioneered some things that we are using, including how you monitor for threats across government, and similarly we’ve shared capability in the other direction.”\n\nIn 2020, Britain’s National Cyber Security Centre disclosed that “our friends at the Canadian Centre for Cyber Security” had allowed it to use Canada’s Host Based Sensor technology to defend British government systems, rather than spending years developing its own.\n\nThe Canadian system places sensors on government of Canada computers that can automatically detect and stop unusual activity, including malware trying to install. It also collects data about malicious activity for analysis. The Centre for Cyber Security, part of CSE, has installed the system on more than 850,000 government of Canada devices, across 85 federal institutions.\n\nThe Five Eyes alliance, in which members agree not to spy on one another, shares intelligence and conducts joint operations, working together in some areas to develop capabilities.\n\nCollecting and sharing “metadata,” or intercepted telecommunications trails, can expand intelligence-gathering operations.\n\nBut CSE has faced criticism from its watchdog in the past that it has unlawfully shared data with foreign allies. CSE is banned from spying on Canadians without a warrant.\n\nThe British report says in some cases, defence intelligence tasks are passed around the Five Eyes to allow 24-hour coverage, through what is known as “follow the sun working” to take advantage of different time zones, the report says.\n\nBritain’s chief of defence intelligence gave as an example an operation where imagery analysts working at an RAF base hand the mission onto Washington, D.C., and then to Canadian partners “who will then hand on to Australian and New Zealand partners who then hand it back to us.”\n\nThe report found that Canadian Forces Intelligence Command also brings added value to the Five Eyes alliance “rather than duplicating capabilities and analyses carried out by others.”\n\nThe report said that Britain is looking at developing its space assets, enabling more satellite surveillance, allowing it to “pay more into the Five Eyes pot.”\n\nThe committee concluded that there “is little prospect” of the Five Eyes expanding its membership, for example to Japan, in the medium term, as the levels of mutual trust required by each partner “to share its most sensitive and closely guarded secrets” are such that the threshold for entry must be very high.\n\nThe report expressed concern about Britain working with countries with lower ethical standards, saying that the “U.K.–U.S. relationship was strained by U.S. actions involving cruel, inhuman and degrading treatment (CIDT), torture and rendition of terrorism suspects” in the early 2000s. The report refers to detention at Guantanamo Bay.\n\nThe committee criticized former British foreign secretary Dominic Raab, who they said misled it when he said he had never authorized action that carried a risk of torture.\n\nThe report said it later received information that “revealed that the then-foreign secretary had in fact authorized action on one occasion that carried a real risk of torture – even though assurances were sought, they did not reduce the risk down to less than a real risk of torture.”\n\nHe had also authorized action, the report said, that carried a real risk of cruel, inhuman and degrading treatment – three times in 12 months – and action that carried a risk of other unacceptable treatment, for example during arrest and detention, on 22 occasions within 12 months.",
        "lang": "en"
    },
    {
        "title": "Boko Haram/ISWAP: Service chiefs, defence minister visit Maiduguri",
        "external_url": "https://gazettengr.com/boko-haram-iswap-service-chiefs-defence-minister-visit-maiduguri/",
        "publication_author": [
            "News Agency Of Nigeria",
            "Tosin Ajuwon",
            ".Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow",
            "Class",
            "Wp-Block-Co-Authors-Plus",
            "Display Inline",
            ".Wp-Block-Co-Authors-Plus-Avatar",
            "Where Img",
            "Height Auto Max-Width",
            "Vertical-Align Bottom .Wp-Block-Co-Authors-Plus-Coauthors.Is-Layout-Flow .Wp-Block-Co-Authors-Plus-Avatar"
        ],
        "publication_date": 1701181664000,
        "description": "",
        "text": "On Tuesday, the Minister of Defence, Muhammad Badaru Abubakar, paid an operational visit to the Theatre Command, Operation Hadin Kai, in Maiduguri.\n\nMr Abubakar was accompanied by the Minister of State for Defence, Bello Mattawalle; the Chief of Defence Staff, Christopher Musa; Chief of Army Staff, Taoreed Lagbaja; Chief of Air Staff, Hassan Abubakar; Chief of Naval Staff, Emmanuel Ogalla and Chief of Defence Intelligence, Emmanuel Undiandeye.\n\nThe minister said he was in Maiduguri in the company of the high-level delegation of the service chiefs assigned by President Bola Tinubu to appraise the security situation in the theatre of operation.\n\nHe said, “President Tinubu asked us to visit the governor and the good people of Borno and our patriotic officers here in Borno to see and to hear from them what is happening both in the frontline and in the cities. What are the progress being made, and what (do) we need to do more to support their operations?\n\n“We had frank and honest discussions with Governor Bagana Zulum before coming here where we discussed the way forward and it is our resolve that in no distant future, we will see the end of the insecurity. He had also shared a lot of strategies with the CDS and the service chiefs and together they agreed on the next line of action and I believe if followed religiously, insecurity in the state will come to an end.”\n\nThe minister commended Governor Babagana Zulum for his support to the military.\n\nMr Zulum said the visit demonstrated the commitment of the service chiefs towards achieving lasting peace in Borno. He said the state’s security situation had improved tremendously due to the successes recorded by the troops.\n\nThe Borno governor cautioned against sensational security reportage, noting that the insurgents leverage such information to breathe despite its diminishing capacity.\n\n“The only way we can degrade their (terrorists’) presence is continued and sustained military operations,” said Mr Zulum.\n\nHe said about 160,000 insurgent fighters and their family members had surrendered due to the non-kinetic effort of the military. The governor sought the support of the military in terms of manpower development to enable the state to curtail the proliferation of transborder small arms and light weapons.\n\n(NAN)",
        "lang": "en"
    },
    {
        "title": "President Tinubu inherited a bankrupt country – NSA",
        "external_url": "https://solacebase.com/president-tinubu-inherited-a-bankrupt-country-nsa/",
        "publication_author": [
            "Biola Adebayo"
        ],
        "publication_date": 1699907370000,
        "description": "",
        "text": "National Security Adviser (NSA), Nuhu Ribadu, has attributed the current financial distress being faced in the country to bankruptcy inherited by the administration led by President Bola Tinubu.\n\nRibadu, however, said despite the financial constraint that has affected budgetary allocations, the federal government would do everything within its power to ensure that there is a robust and viable defence management and apparatus in the country.\n\nThe NSA stated these in Abuja when he spoke at the Chief of Defence Intelligence Annual Conference 2023 themed: “Leveraging Defence Diplomacy and Effective Regional Collaboration for Enhanced National Security”.\n\nRead Also: Despite court order, NLC, TUC vow to proceed with planned strike\n\nDaily Trust reports that the conference, which held in Abuja, was attended by Minister of Defence, Abubakar Badaru; Minister of State, Bello Matawalle; Permanent Secretary in the Defence Ministry, Ibrahim Kana; the Chief of Defence Staff, and other service chiefs.\n\n“I assure you that the federal government will not rest on its oars in ensuring a robust and viable defence management and security apparatus to address contemporary challenges even in the face of enormous budgetary constraints.\n\n“Yes, we’re facing budgetary constraints. It is okay for me to tell you. Fine, it is important for you to know that we have inherited a very difficult situation, literally a bankrupt country, no money, to a point where we can say that all the money we’re getting now, we’re paying back what was taken. It is serious!\n\n“But this administration is doing its best to meet our requirements, particularly the armed forces, and I believe that you leaders will be able to testify to that,” the former chairman of the Economic and Financial Crimes Commission told the gathering.\n\nRead Also: FG cautions NLC, TUC against politicising protest\n\nAccording to him, the armed forces under the current leadership has shown serious commitment in addressing the prevailing security challenges bedevilling the country, adding that there were positive changes and improvements both in and outside Nigeria.\n\n“Let us come together as one and continue to support our armed forces and other security agencies with this work of securing our country for peace and stability.\n\n“They have done an amazingly good job without talking and I believe that with the support and the resolve of the leadership we have today in our country, things will only be better.\n\n“We are just four or five months old, but certainly things have changed and we believe that what they are doing, they are doing it right. We want to encourage them, stand by them and support them 100 per cent and hopefully, this country will be okay in a short time,” he said.\n\nThe NSA added that the coups in Mali, Burkina Faso, Niger, Gabon, and Guinea had led to a sudden reversal of democratic fortunes in those countries.\n\nHe noted that the essence of defence diplomacy was to pursue strategic engagement with allies and partners at bilateral and multilateral levels while ensuring the attainment of national security objectives.\n\nRead Also: ACReSAL to introduce technology for preventing solid waste pollution in Kano State\n\nOn his part, the Chief of Defence Intelligence (CDI), Maj.-Gen. Emmanuel Undiandeye said the agency was determined to harness the capabilities of the defence attaché system for the attainment of national security objectives.\n\nUndiandeye said the current and emerging threats facing Nigeria were numerous, complex, integrated, multifaceted and diverse in nature with attendant security implications for national security.\n\nThese threats, according to him, have both internal and external perspectives, and range from terrorism, high force secessionist agitation, armed mandatory kidnapping, herders-farmers clashes and cyber threat.\n\nDaily Trust",
        "lang": "en"
    },
    {
        "title": "Tinubu’s High Powered Team Inspects MV Kali, Vessel Arrested with Stolen Crude Oil – THISDAYLIVE",
        "external_url": "https://www.thisdaylive.com/index.php/2024/01/16/tinubus-high-powered-team-inspects-mv-kali-vessel-arrested-with-stolen-crude-oil/",
        "publication_author": [
            "Deji Elumoye",
            "Emmanuel Addeh",
            "Olawale Ajimotokan"
        ],
        "publication_date": 1705363200000,
        "description": "",
        "text": "•Commends Tantita, other private security firms\n\nSylvester Idowu in Warri\n\n\n\n\n\nPresident Bola Ahmed Tinubu deployed a high powered team yesterday to inspect MV Kali, the vessel that was arrested last Thursday at Pennington Oil field in Bayelsa with stolen crude, by operatives of the Tantita Security Services Limited (TSSL) and Nigerian Security and Civil Defence Corps (NSCDC).\n\nThe Chief of Defence Staff, Major General Christopher Musa, led other team members comprising the Chief of Defence Intelligence, Major General Emmanuel Undiandeye; Group Chief Executive Officer of Nigerian National Petroleum Company Limited (NNPCL) Mallam Mele Kolo Kyari and Chief Upstream Investment Officer, Bala Wunti.\n\nThey were joined by the Commander, Joint Task Force (JTF) Operation Delta Safe (OPDS), Rear Admiral Olusegun Ferreira and Commander, Nigerian Navy Ship Delta, Commodore Chindo Yahaya and other senior military officers.\n\nSpeaking with Journalists shortly after inspection of the vessel and 23 crew members and accomplices arrested at Oporoza in Warri South West Local Government area of Delta State, yesterday, General Musa said President Bola Ahmed Tinubu directed the “high powered team” to visit the scene and inspect the vessel.\n\nHe noted that the team was in Oporoza based on the arrested vessel which he said was a major achievement adding, “It shows that we are committed in ensuring that we stop this criminality within the maritime environment.”\n\nGeneral Musa said the successes recorded were not solely by an organization but a collaborative effort to stem further crude oil theft in the region.\n\n“This is a collaborative effort and we will continue to collaborate with the NNPCL and other private security agencies. The main federal government agencies are also working together. I don’t want a situation where we create it as if there’s enmity between this group and that group.\n\n“We’re working for the same goal; we are all Nigerians. This is our country. Whatever is happening here are acts of criminality that must be stopped by all means. So, I want to make that very clear that all Nigerians must put hands on deck to ensure that we stop these acts.\n\n“The country is bleeding. We need all the forms we need so that this country can grow and develop and it just by stopping criminals like this that will make that very possible”, he said.\n\nHe said further, “So why we are here is to come and see; to identify them. The Chief of Defense Intelligence is going to go straight into investigation as to who is involved, what was taken, who sent them, and this is because we want to catch the perpetrators.\n\n“These ones are just the ground troops that are being used; the main actors are there behind, and I want to use this opportunity to warn all those that don’t want to stop this – that enough is enough”.\n\nThe CDS noted that the armed forces, the security agencies, communities and private security agencies were working in synergy to achieve a common goal.\n\n“The Armed Forces, the security agencies, the communities, private security agencies, wherever they are; as long as they are contracted by the federal government, we are going to work together as a team”, he said.\n\nInsisting that there was no competition amongst the security agencies and the private security companies, General Musa advised the media to stop making it look like there were fights amongst them.\n\n“Whatever arrests done are collaborative efforts. We are going to continue to do that. And so that is very important.\n\n“We are happy that these have been arrested. We are going to take it off from here and we are going to do more because, henceforth, we are going to enhance our collaboration in ensuring that we check these menace”, he added.\n\nHe noted that Nigeria must grow and warned that individuals cannot hold the nation to ransom adding: “There are very few individuals who are making profit from this. And they don’t want to stop because I would have expected that by now, from all the actions that have been taken to discourage people from doing it. But you can see that people are still hell-bent to steal our crude for their own selfish gains and that must stop.\n\n“We will enhance this capacity, and this year, we will ensure that Nigeria oil production goes up, as much as possible, so that we can all benefit as Nigerians.”",
        "lang": "en"
    },
    {
        "title": "Buhari’s Administration Bankrupted Nigeria, Says NSA Ribadu",
        "external_url": "https://www.arise.tv/buharis-administration-bankrupted-nigeria-says-nsa-ribadu/",
        "publication_author": [
            "Chioma Kalu",
            "Melissa Enoch",
            "Blessing Ibunge",
            "Nneoma Udensi",
            "Ozioma Samuel-Ugwuezi"
        ],
        "publication_date": 1699953282000,
        "description": "",
        "text": "The National Security Adviser Mallam Nuhu Ribadu, on Monday, declared that former President Muhammadu Buhari’s administration bankrupted Nigeria.\n\nIn the first official pronouncement of the federal government on the state of finances of the government after Buhari’s eight years administration, the nation’s top security man, affirmed that the President Bola Tinubu-led government inherited a “bankrupt country”.\n\nRibadu, who spoke at the Chief of Defence Intelligence Annual Conference themed: “Leveraging Defence Diplomacy and Regional Collaboration for Enhanced National Security”, said the federal government was “paying back what was taken” or stolen.\n\nIn a no-holds-barred remark, Ribadu stopped short of saying that the nation was stolen blind by the last administration, rendering the treasury empty.\n\n“We are facing very serious budgetary constraints. It is okay for me to tell you. It is fine for you to know. We have a very serious situation.\n\n“We have inherited a very difficult country, a bankrupt country to the extent that we are paying back what was taken. It is serious.\n\n“But this administration is doing its best to meet our requirements including that of the armed forces,” he lamented.\n\nSpeaking at the occasion attended by the Ministers of Defence, Mohammed Badaru and Bello Matawalle, Chief of Defence Staff, (CDS), Gen Christopher Musa, service chiefs and former service chiefs, on the security situation in the country, he praised the Armed Forces of Nigerian (AFN) for their exemplary performance that kept the peace of the nation.\n\n“You have done well and you are doing well. You are the reason why we are a nation today. This country is grateful. You are the reason why we have peace. We have a very solid security team, the service chiefs”, he said.\n\nRibadu noted that in spite of the constraints, the security situation in the country had improved significantly.\n\n“Things have changed. Things are changing. You may not be reading it but things have changed. You have given live back to the office of the NSA”, he said.\n\nHe commended the defence attaches for the wonderful job they were engaged in and urged them to do more.\n\nHe said the defence attachee system was a way to ensure good relationship between Nigeria and host countries.\n\nThe NSA said the improved security situation has led to reduction from 1,200 violent deaths to 100.\n\n“We used to have 1,200 violent deaths before in the country. Now we have less than 100 deaths”, he said.\n\nRibadu maintained that following the improved security situation in the country, not a single death was recorded in Borno State, an erstwhile battleground for insurgents.\n\nHe disclosed that security forces quietly rescued 600 kidnap victims, who were in captivity for two years.\n\n“We have not witnessed one single death in Borno state since the coming of this administration.\n\n“We rescued 600 kidnap victims who have been in captivity for two years without making any noise about it”, he said.\n\nThe security chief further maintained that the improving security situation in the country had led to increased output in the production of crude oil when placed against last year’s figures.\n\n“Crude output has risen to 1.7 million barrels per day from 900,000 barrels per day since last year,” he said.\n\nEarlier in his remarks, the Chief of Defence Intelligence, Maj Gen EAP Undiandeye, said the conference was organized to enable the agency to respond to present and future threats and to prepare defence attaches to be able to identify threats.\n\nFollow us on:",
        "lang": "en"
    },
    {
        "title": "Tinubu inherited a bankrupt country -NSA",
        "external_url": "https://punchng.com/tinubu-inherited-a-bankrupt-country-nsa/",
        "publication_author": [
            "Solomon Odeniyi"
        ],
        "publication_date": 1699910996000,
        "description": "",
        "text": "The National Security Adviser, Nuhu Ribadu, has lamented that the current administration inherited a bankrupt country that was responsible for the budgetary constraints.\n\nAccording to him, the revenue generated by the Bola Tinubu-led administration is being used to repay what was taken from the country.\n\nThe NSA stated this on Monday in Abuja at the Chief of Defence Intelligence Annual Conference 2023.\n\nRibadu, however, said despite the financial constraint that has affected budgetary allocations, the Federal Government would do everything within its power to ensure that there is a robust and viable defence management and apparatus in the country.\n\nHe said, “I assure you that the Federal Government will not rest on its oars in ensuring a robust and viable defence management and security apparatus to address contemporary challenges even in the face of enormous budgetary constraints.\n\n“Yes, we’re facing budgetary constraints. It is okay for me to tell you. Fine, it is important for you to know that we have inherited a very difficult situation, literally a bankrupt country, no money, to a point where we can say that all the money we’re getting now, we’re paying back what was taken. It is serious!\n\n“But this administration is doing its best to meet our requirements, particularly the armed forces, and I believe that you leaders will be able to testify to that,” the former chairman of the Economic and Financial Crimes Commission told the gathering.”\n\nHe also said the armed forces under the current leadership has shown serious commitment to addressing the prevailing security challenges bedeviling the country.\n\n“Let us come together as one and continue to support our armed forces and other security agencies with this work of securing our country for peace and stability.\n\n“They have done an amazingly good job without talking and I believe that with the support and the resolve of the leadership we have today in our country, things will only be better.”",
        "lang": "en"
    },
    {
        "title": "Insurgency: Defence ministers storm Maiduguri, task troops on professionalism",
        "external_url": "https://authorityngr.com/2023/11/28/insurgency-defence-ministers-storm-maiduguri-task-troops-on-professionalism/",
        "publication_author": [
            "Joe Abuchi",
            "The Authority Newspapers Is Published Authority Media",
            "Publications Limited With Headquarters In Abuja - Fct.",
            "Our Vision Is To Be The Best Newspaper In Nigeria",
            "One Of The Best In Africa",
            "Operating As A Viable Business",
            "Serving The Best Interests Of The Citizens As The Watchdog Of The Nation",
            "Defender Of Nigeria'S Nascent Democracy.",
            "Founded August"
        ],
        "publication_date": 1701129600000,
        "description": "",
        "text": "The Minister of Defence, Muhammad Badaru Abubakar, and the Minister of State for Defence, Bello Mattawalle, on Tuesday paid an operational visit to the Theatre Command, Operation Hadin Kai (OPHK), in Maiduguri.\n\nThe ministers were accompanied by the Chief of Defence Staff (CDS), Gen. Christopher Musa, Chief of Army Staff (COAS), Lt.-Gen. Taoreed Lagbaja, Chief of Air Staff (CAS), Air Marshal, Hassan Abubakar, Chief of Naval Staff, Vice Admiral Emmanuel Ogalla, and Chief of Defence Intelligence (CDI), Maj.-Gen. Emmanuel Undiandeye.\n\nSpeaking during the operational visit, Badaru said that the team was in Maiduguri with the high-level delegation of the Service Chiefs assigned by President Bola Tinubu to assess the security situation in the theatre of operations.\n\nThe spokesperson to the minister of state for Defence, Comrade Anas Abdullahi in a statement shared with journalists in Abuja, said the ministers were in Maiduguri with the high-level delegation of the Service Chiefs assigned by President Bola Tinubu to assess the security situation in the theatre of operations.\n\n“President Tinubu asked us to visit the governor, the good people of Borno, and our patriotic officers here in Borno to see and hear from them what is happening both on the frontlines and in the cities.\n\n“What is the progress being made, and what do we need to do more to support their operations?\n\n“We had frank discussions with Gov. Bagana Zulum before coming here, where we discussed the way forward, and it is our resolve that in no distant future, we will see the end of the insecurity.\n\nThe Ministers also charged troops of OPHK to remain professional in their conduct and imbibe the warrior ethos in the ongoing Counter Terrorism and Counter Insurgency (CTCOIN) Operations and reiterated the commitment of government to the welfare of military and families of those who lost their lives in service to the nation.\n\nFurthermore, the ministers embarked on an inspection visit to 7 Division medical services and hospital in Maimalari Barracks.\n\nThe two ministers reassured that Nigeria under the leadership of Tinunu would continue to place a high premium on the welfare of troops by providing all necessary logistics to deal with security challenges effectively.",
        "lang": "en"
    },
    {
        "title": "That DIA Conference and Plaudits Showered on the Military",
        "external_url": "https://prnigeria.com/2023/12/03/dia-conference-plaudits/",
        "publication_author": [
            "Mukhtar Y"
        ],
        "publication_date": 1701561600000,
        "description": "",
        "text": "That DIA Conference and Plaudits Showered on the Military\n\nBy MUKHTAR Ya’u Madobi\n\nThe unwavering commitments and efforts of the officers and men of the Nigerian Military on counter-terrorism have never gone unnoticed by concerned stakeholders , pundits, groups and other public commentators.\n\nAt many instances, civil society organizations and advocacy groups have hailed the Nigerian troops in waging wars against criminals nationwide, especially the insurgents in the northeast as well as bandits and kidnappers in the northwest.\n\nThis is due to the current visionary leadership of the Chief of Defence Staff, CDS, General Christopher Gwabin Musa with the support of other heads of Armed Forces of Nigeria.\n\nThe successes recorded by the military should of course be attributed to the manner in which it leverages on gathering and sharing actionable intelligence among its personnel aimed at enhancing security.\n\nThese behind the scenes activities are being coordinated and supervised by the military intelligence gathering body- the Defence Intelligence Agency, DIA, which is one among Nigeria’s intelligence communities.\n\nAs a testimony to the Military’s relentless quest in defending the nation’s territorial integrity against any form of external and internal threats, the National Security Adviser, NSA, Malam Nuhu Ribadu, was very elated and did not hesitate in pouring his floodgates of encomiums to that cause.\n\nMalam Ribadu, noted that the contribution of the military to the continuous existence of Nigeria as a single corporate entity can never be downplayed especially at this critical moment when there is resurgence of emerging threats globally.\n\nThe national coordinator of the security spoke in Abuja during this year’s Chief of Defence Intelligence Annual Conference 2023 for Defence Advisers and Attache’s with the theme: ‘Leveraging Defence Diplomacy and Effective Regional Collaboration for Enhanced National Security’.\n\nHe said the armed forces under the current leadership had shown serious commitment to addressing the prevailing security challenges bedeviling the country, adding that there were positive changes and improvements both in and outside Nigeria.\n\n“Under 5 months that we came on board, you, the armed forces of Nigeria have done well and you are doing well. You are the reason why we have a country like Nigeria today. You are doing a good job for over 240 million Nigerians.\n\n“I want to thank the solid team of the CDS and the Service Chiefs. Today you have worked and literally made everyone comfortable in Nigeria.” Ribadu said.\n\nWhile commenting on the improved level of nationwide security, Ribadu said that, “On record, we used to have about 1,300 people being killed by violent attacks by criminal elements but right now, it is less than 100. In the Niger Delta, Crude oil production used to be between 700,000 to 900,000 barrels per day, last year but today it is 1.7 million barrels per day.\n\n“Last year, in the South East, there were 46 attacks on Police Stations. This year, we have not recorded a single attack on any police station in the last few months.\n\nIn the fight against kidnappers and bandits, according to the NSA, from July to date, the armed forces and security agencies have secured the release of over 600 kidnapped people, including some who had been held captive for over three years.\n\n“Today you can drive to Kaduna, even at night without attacks. Thank you armed forces for this.” Ribadu added while hailing the Military.\n\nThe NSA observed that the renewed synergy among services had led to the recent successes being recorded in dealing with the threats they had become increasingly asymmetric and the activities of armed non-state actors remaining prevalent in the West African sub-regions.\n\nIn his part, the Minister of Defence, Mohammed Abubakar Badaru tasked the defence advisers and attaches to aim towards providing a sustainable solution through defence diplomacy and code on better information sharing system.\n\nHe urged them to utilise the opportunity to energise the resolve to serve the country better in their various capacities while respecting the principle of certainty and non-interference in the internal affairs of other nations.\n\nAlso, the Minister of State for Defence, Bello Mohammed Matawalle, urged the DIA and Defence Attaches/Advisers to promote mutual understanding and sharing of enhanced intelligence. According to him, the Attaches/Advisers have important roles to play in an increasingly interconnected world where security challenges transcend borders.\n\nHe noted that the insecurity challenge in the country was not an isolated incident but a general phenomenon that required coordinated response and collaboration with allied partners by contributing significantly to strengthening the national security apparatus.\n\nIn his welcome remarks, the Chief of Defence Intelligence (CDI), Maj.-Gen. Emmanuel Undiandeye said the agency was more intentional and determined in its efforts to harness the capabilities of the defence attaché system for the attainment of national security objectives.\n\nUndiandeye said the current and emerging threats facing Nigeria were numerous, complex integrated, multifaceted and diverse with attendant security implications for national security.\n\nThe week-long annual event gives DIA the opportunity to appraise the activities of its defence sections all over the world. It also helps agency DIA to identify new lessons, discuss modalities for common challenges, as well as to strategize for the future engagements.\n\nMUKHTAR is the author of a book on “National Security Strategy” and is a staff writer with the Emergency Digest.",
        "lang": "en"
    },
    {
        "title": "Pipeline protection: CDS asks media not to create conflict among",
        "external_url": "https://punchng.com/pipeline-protection-cds-asks-media-not-to-create-conflict-among-security-agencies/",
        "publication_author": [
            "Dele Ogunyemi"
        ],
        "publication_date": 1705620347000,
        "description": "",
        "text": "The Chief of Defence Staff, General Christopher Musa, has cautioned the media against creating ‘seamless enmity’ among the various security agencies engaged in the surveillance of oil pipelines in the Niger Delta region.\n\nThe CDS, who led a high-powered presidential delegation to the creeks of Oporoza, Gbaramatu kingdom in Delta State, made the call on Monday while inspecting the massive oil bunkering vessel, MT Kali, which was arrested in the offshore location of the Anglo-Dutch energy giant, Shell Petroleum Development Company, in Bayelsa State, by joint operatives of Tantita Security Services Nigeria Limited and the Nigerian Security and Civil Defence Corps.\n\nThe presidential team also inspected the 23 suspects intercepted on the ill-fated vessel, including the ship’s captain and engineer, David Adeboye and Promise Eze, respectively.\n\nAlso in the presidential delegation with the CDS were the Chief of Defence Intelligence, Major-General Emmanuel Undiandeye; the Group Chief Operating Officer of NNPCL, Engr Mele Kyari; the Chief of Naval Staff, Vice Admiral Emmanuel Ogalla; the Commander, Joint Task Force/Operation Delta Safe, Rear Admiral Olusegun Fereira; the representative of Delta State Commandant of the NSCDC, Suleiman Jimoh, as well as other top military chiefs.\n\nExpressing delight at the feat jointly performed by Tantita and NSCDC, the CDS said, “We are happy this has been arrested. The main Federal Government agencies are working together. I don’t want a situation where we create a seamless enmity between this group and that group. There is no immutability loss.\n\n“We are working for the same goal. We are all Nigerians. This is our country. Whatever is happening here is acts of criminality that must be fought by all Nigerians. So, I want to make it very clear that all Nigerians must put hands on deck to ensure that we stop these acts.\n\n“The country is bleeding. We need all the funds we can get so that this country can grow and develop and it is just by stopping these criminals like this, that will make that possible.\n\n“We are here based on the report of the arrest of the ship that we are on. And I think it is a major achievement. It shows that we are committed to ensuring that we stop these criminalities within the maritime environment. This is a collaborative effort and we will continue to collaborate with the NNPC, the other private security and justice.\n\n“While we leave here, the Chief of Defence Intelligence is going to go straight into investigation as to who are involved? Who sent them? Etc. And this is because we want to not only catch the perpetrators, but dig deeper into their modus operandi. These ones (suspects) are just the ground troops that are being used. The main actors, the barons, are there behind and that’s why I want to use this opportunity to warn all those that don’t want to stop this illegality that ‘enough is enough.’\n\n“The Armed Forces, the security agencies, the communities, private security agencies, wherever they are, they are contracted. As long as they are contracted by the Federal Government, we are going to work together as a team. There is not going to be any competition between us.\n\n“And please, the media should stop making it look as if we are in a fight. There is no fight. Whatever arrest has been done is done collaboratively, and we are going to continue to do that.\n\n“We are going to take it off from here, and we are going to do more, because henceforth we are going to enhance our collaboration and our joint efforts in ensuring that we check this menace.\n\n“Nigeria must grow. Individuals cannot hold us back. They are busy, very few individuals that are making profit from this. And they don’t want to stop, because it is expected that by now, from all the actions so far taken by government to stop people from doing it, you can see that some unpatriotic people are still hell bent and committed to stealing our crude for their own selfish gain. But that must stop.\n\n“So, I want to thank you for this opportunity that we are here. And to make it very clear that we are all working together as a team. We will enhance this capacity and this year, we will ensure that Nigeria’s oil production goes up as much as possible, so that we can all benefit as Nigerians.”",
        "lang": "en"
    },
    {
        "title": "SANDF denies reports of ‘death squads’ in military",
        "external_url": "https://www.jacarandafm.com/news/news/sandf-denies-reports-death-squads-military/",
        "publication_author": [],
        "publication_date": null,
        "description": "",
        "text": "Addressing the media in Pretoria on Thursday, SANDF chief Rudzani Maphwanya said the defence force will always operate within the boundaries of the constitution.\n\n\n\n\n\nIt comes amid reports in the Daily Maverick that soldiers are allegedly responsible for acts of torture and murder.\n\n\n\n\n\nThe evidence implicates at least four units of the SANDF in crimes dating back to 2019.\n\n\n\n\n\n\"There are no military squads in the defence force,” Maphwanya said.\n\n\n\n\n\n“The South African National Defence Force stands for the defence and protection of the people and will always act within the confines of the law and constitution.\n\n\n\n\n\n\"We are still the last line of defence for the people of South Africa, and whatever we do, we do it to ensure that South Africans are able to go on with their day-to-day activities without any fear.\"\n\n\n\n\n\nHe added that the SANDF is the only organisation which will continue to fight for the constitution even at the cost of their own lives.\n\n\n\n\n\n\"We will continue to defend the constitution, even with the cost of our lives. When it comes to the interest of South Africans, we will always strive to achieve what our people would like to achieve and assist them in whatever form.\"\n\n\n\n\n\nThe Chief of Defence Intelligence, Major-General Thalitha Mxakato, said the Board of Inquiry which was instituted to probe the allegations has not concluded its work.\n\n\n\n\n\n\"There has never been any attempt to disregard any critical information that may tarnish the image of the SANDF, and hence, when these allegations came forth, the first thing to do was to put a team that was going to get to the core of the issues.\"\n\n\n\n\n\nALSO READ",
        "lang": "en"
    },
    {
        "title": "Blaming Buhari Over Current Hardship Disrespectful to Nigerians, Says APC Chieftain",
        "external_url": "https://www.legit.ng/nigeria/1566977-blaming-buhari-current-hardship-disrespectful-nigerians-apc-chieftain/",
        "publication_author": [
            "Segun Adeyemi"
        ],
        "publication_date": 1701712596000,
        "description": "",
        "text": "President Bola Ahmed Tinubu has been advised to man up and tackle the previous administration's failures\n\nThis came after the national security adviser to the president, Nuhu Ribadu, and Governor Dapo Abiodun of Ogun state criticised the previous government\n\nHowever, a chieftain of the All Progressive Congress (APC), Salihu Lukman, said such body language depicts that this government is dishonest\n\nLegit.ng journalist Segun Adeyemi has over 9 years of experience covering political events, civil societies, courts, and metro\n\nSalihu Lukman, former Director General of the Progressives Governors Forum (PGF), has criticised Ogun State Governor Dapo Abiodun and the National Security Adviser to the President, Nuhu Ribadu, for attributing the current challenges faced by Nigerians to former President Muhammadu Buhari.\n\nLukman, an APC member, asserted that for President Asiwaju Tinubu to gain the confidence of Nigerians, he must acknowledge his responsibility as the leader of the APC for the shortcomings during Buhari’s tenure.\n\nPresident Bola Tinubu has been urged to take responsibility for the failures of ex-President Muhammadu Buhari. Photo Credit: The Presidency\n\nSource: Facebook\n\nGov Abiodun, NSA Ribadu slams Buhari\n\nThe National Security Adviser, Nuhu Ribadu, had stated on November 13, 2023, during the Annual Conference of Chief of Defence Intelligence, that President Tinubu inherited a financially distressed country.\n\nPAY ATTENTION: Сheck out news that is picked exactly for YOU ➡️ find the “Recommended for you” block on the home page and enjoy!\n\nSimilarly, on November 26, 2023, Governor Dapo Abiodun, appearing on Channels Television’s Sunday Politics, claimed President Bola Tinubu took over a nearly inactive administration.\n\nIn response to these statements, Lukman, the former APC National Vice Chairman (North-west), released a statement in Abuja on Monday, December 4, asserting that these explanations were offered to justify the ongoing challenges faced by Nigerians.\n\nLukman emphasised the need to focus on informing the public about concrete actions to address the problems rather than providing excuses.\n\nHe said:\n\n\"Excuses would only confirm that we are in denial that a government produced by our party is perhaps responsible for Nigeria’s challenges.\n\n\"Once we are in denial, it also suggests that we are going to grandstand when we initiate actions that worsen the situation or fail to initiate actions to resolve the problem.\n\n\"This will simply mean being dishonest, which will narrow our responses to making excuses for our failure or inability to meet expectations of Nigerians. This must be avoided.\n\n\"It is quite worrisome that coming from a party envisioned to be progressive we are giving excuses. How can we Renew the Hope of Nigerians by giving excuses. We must appeal to our leaders to stop giving excuses and take responsibility.\"\n\n2024 Appropriation Bill: Why Tinubu’s budget lacks strategic plan to improve Nigerians\n\nIn another report, President Bola Tinubu faces a litmus test to prove doubters and opposition wrong after presenting the N27.5 trillion 2024 appropriation bill.\n\nThere are criticisms that the budget lacks the potency to curb the sufferings and hardship of Nigerians.\n\nExecutive director of the Civil Society Legislative Advocacy Centre (CISLAC), Auwal Musa Rafsanjani, said the budget needed more clarity in strategically delivering its objectives.\n\nSource: Legit.ng",
        "lang": "en"
    },
    {
        "title": "Defence minister, COAS demand total loyalty from newly promoted Army Generals",
        "external_url": "https://tribuneonlineng.com/defence-minister-coas-demand-total-loyalty-from-newly-promoted-army-generals/",
        "publication_author": [
            "Jacob Segun Olatunji"
        ],
        "publication_date": 1703860364000,
        "description": "",
        "text": "The Minister of State for Defence, Dr Bello Matawalle, and the Chief of Army Staff COAS, Lieutenant-General Taoreed Lagbaja, have charged the newly promoted senior officers of the Nigerian Army to show exemplary leadership and intensify efforts in the fight against insecurity, especially in the North West and other troubled parts of the Country\n\nin a bid to strengthen national security and combat emerging security challenges,\n\nThe duo took charge at the investiture ceremony of the 47 newly promoted Brigadier Generals to the rank of Major General held in Abuja.\n\nThis was contained in a statement made available to Defence Correspondents by Director Army Public Relations, Major General Onyema Nwachukwu\n\nAccording to the statement, the Minister noted that their promotion was a testament to their courage, dedication to duty and hard work, adding that it was a reward for diligence, professional conduct and selfless sacrifices.\n\nHe then highlighted the need for the newly promoted senior officers to lead by example, inspire their subordinates and collaborate with other security agencies to surmount the security challenges in the country.\n\nThis acknowledges the rigorous process of selecting the promoted senior officers, reflecting their exceptional leadership skills, strategic thinking, and in-depth understanding in the course of their careers.\n\nHe noted that their contributions to the Nigerian Army were invaluable and expressed confidence in their continuous service to the nation.\n\nIt added that while congratulating the senior officers on behalf of the President, Commander in Chief of the Armed Forces of Nigeria, Bola Ahmed Tinubu, Dr Matawalle assured of the Federal Government’s adequate welfare interventions and continued support to the Armed Forces of Nigeria. It further explained that the Chief of Army Staff COAS, Lieutenant-General Taoreed Lagbajan in his remarks at the investiture, felicitated with the newly promoted senior officers on their well-deserved elevation and pointed out that their competencies, diligence and loyalty earned them their promotion.\n\nAccording to it, he appreciated the spouses and families of the elevated senior officers for their understanding and support and for coping with the absence of parents, regularly separated by duty to fatherland. It added that the Army boss highlighted the need for every personnel to augment their career paths and reminded the newly elevated senior officers of the enormous responsibilities that come with their new rank.\n\nHe urged them to constantly seek knowledge on diplomatic, economic and political dynamics and be logical and objective in their contributions to the Nigerian Army.\n\nHe also charged the senior officer and the Commander in Chief of the Armed Forces to be loyal to the constitution of the Federal Republic of Nigeria. General Lagbaja urged the senior officers in their new appointments, to give life to his Command Philosophy of “transforming the Nigerian Army into a well-trained, equipped and highly motivated force towards achieving our constitutional responsibilities in a joint environment”. Related Posts Nigeria is winning war against insecurity – Defence Minister China sacks defence minister, Li Shangfu, after two-month disappearance Israel not seeking war with Hezbollah in Lebanon — Defence Minister Speaking on behalf of the newly decorated senior officers, Major General Gabriel Ajetunmobi appreciated President Bola Ahmed Tinubu for endorsing their promotion to the rank of Major General in the Nigerian Army. He also thanked him for creating an enabling environment, guidance and support for the Chief of Army Staff to steer the affairs of the Nigerian Army.",
        "lang": "en"
    },
    {
        "title": "Army honours 113 Generals on retirement",
        "external_url": "https://dailypost.ng/2023/12/20/army-honours-113-generals-on-retirement/",
        "publication_author": [
            "Matthew Atungwu"
        ],
        "publication_date": 1703030400000,
        "description": "",
        "text": "The Nigerian Army on Tuesday honored 113 retired generals for their 35 years of meritorious service to the nation.\n\nThe senior officers, comprising one General, a Lieutenant General, 67 major generals and 44 brigadier generals are those who retired or due for retirement within the year.\n\nAmong those honoured are the immediate past Chief of Defence Staff, retired Gen. Lucky Irabor; former Chief of Army Staff, Lt.-Gen. Faruk Yahaya; and Ex-Chief of Defence Intelligence, retired Maj.-Gen. Samuel Adebayo.\n\nAccording to the Minister of Defence, Alhaji Muhammad Badaru, the occasion was to reflect on the extraordinary services and profound commitment demonstrated by the generals.\n\nBadaru said their experiences and skills, as well as integrity, discipline, dedication, loyalty and respect for diversity, would guide them in their future endeavours.\n\nHe noted that the generals had led their troops with courage, wisdom and determination, and devoted themselves to the protection and defence of the nation.\n\nThe minister pointed out that they persistently pursued excellence and demonstrated firm commitment to duty, selfless sacrifice and astute leadership, leaving an indelible mark on the armed forces and the nation.\n\nHe, therefore, urged them to consider joining politics to bring discipline and love of the country to the system.",
        "lang": "en"
    },
    {
        "title": "CDS advocates non-kinetic approach to tackling insecurity",
        "external_url": "https://punchng.com/cds-advocates-non-kinetic-approach-to-tackling-insecurity/",
        "publication_author": [
            "Solomon Odeniyi"
        ],
        "publication_date": 1705945987000,
        "description": "",
        "text": "The Chief of Defence Staff, Gen. Christopher Musa, has advocated for the use of the non-kinetic approach in the ongoing fight against criminality in the country.\n\nAccording to him, no fewer than 2,000 Boko Haram terrorists, through a non-kinetic approach, surrendered to the troops in the height of insurgency in the country.\n\nMusa spoke while delivering a lecture at the opening of the National Security Course on `Psychological Operations and Strategic Communication in Abuja on Monday.\n\nRepresented by the Director of Training, Defence Headquarters, Rear Adm. Daupreye Matthew, Musa, however, said the military has up-scaled the use of hard and soft power in counter-insurgency operations to contain emerging and changing nature of adversaries.\n\nHe said, “The use of non-kinetic efforts under Operation Safe Corridor led to the surrender of more than 2,000 Boko Haram members between 2016 and 2017. 67 per cent of those who surrendered were of the Abubakar Shekau faction of the insurgents.\n\n“Also, 1,543 repentant terrorists graduated from Mallam Sidi Camp in Gombe State and 1,935 were released from Bulumkutu camp in Borno between 2016 and 2022.\n\n“From July 2021 to May 4, 2022, alone, no fewer than 51,828 terrorists and their family members surrendered, out of which 13,360 were fighters.\n\n“So far, 106,000 terrorists and their family members have surrendered in the North East.”\n\nHe also advocated for individual case management, referral services, community-based peacebuilding, reconciliation, and reintegration to combat insecurity in the country.\n\nThe Chief of Defence Intelligence, Maj.-Gen. Emmanuel Undiandeye, said that the 5-day programme was to boost security experts’ understanding of the dynamics of psychological operations and strategic communication.\n\nUndiandeye described psychological operation and strategic communication as an integral element of modern warfare but was widely neglected by communication science despite its importance.\n\nAccording to him, it is now used not only to manipulate an enemy’s will to fight but also to influence public opinion.\n\nHe said the employment of strategic communication influences operations and non-kinetic tools to win hearts and minds and enhance national security and cohesion.",
        "lang": "en"
    },
    {
        "title": "Defence Minister Conducts Spot Assessment Of Troops In Borno",
        "external_url": "https://thewhistler.ng/defence-minister-conducts-spot-assessment-of-troops-in-borno/",
        "publication_author": [
            "Nneoma Benson"
        ],
        "publication_date": 1701261390000,
        "description": "",
        "text": "396 SHARES Share Tweet [mc4wp_form id=33047]\n\nThe Minister of Defence, Mohammed Abubakar has conducted a spot assessment of the troops of Joint Task Force (JTF) North East Operation HADIN KAI in Borno State.\n\nAbubakar in his visit to Borno had earlier visited the Governor of the State, Babagana Zulum where he expressed appreciation on behalf of the Federal Government for continuous support to the Nigerian Military in the fight against insurgency.\n\nAdvertisement\n\nThe Defence Minister while addressing the troops at the 212 Battalion parade ground in Maimalari Military Cantonment Maiduguri said his visit was also aimed at conducting an assessment of the challenges they are confronted with.\n\nHe assured the troops of the president’s commitment towards providing lasting solutions to their challenges and ensuring that the welfare of troops is of topmost priority.\n\nA statement by the Nigerian Army on Wednesday noted that the Defence minister was briefed on the operational activities and security situation in the North East theatre.\n\nThe Theatre Commander Major General Gold Chibuisi briefed the minister on the milestone attained in the restoration of peace in Borno and the contiguous states.\n\nAdvertisement\n\nOn the Defence minister’s entourage were the Honourable minister of State for Defence, Dr Bello Matawalle, the Chief of Defence Staff, General Christopher Musa, Chief of Army Staff, Lieutenant General Taoreed Lagbaja, Chief of Naval Staff, Vice Admiral Emmanuel Ogalla, Chief of the Air Staff, Air Marshal Hassan Abubakar and the Chief of Defence Intelligence Major General Emmanuel Undiandeye.\n\nAlso present during the visit were Principal Staff Officers from Defence and Services Headquarters, General Officer Commanding 7 Division, Component Commanders, Heads of Security Agencies and Paramilitary Organisations, amongst others.\n\nDespite the operation of the Nigerian Army in the region, terrorist activities are purportedly thriving following the activities of extremist groups in constant war for dominance in the region.\n\nIn recent times, emerging reports have shown how rival terrorist groups engage in fatal wars leading to the deaths of foot soldiers and in other cases, civilians in communities loyal to a terrorist group.\n\nAlso, there have been reports of communities paying taxes to terrorists in some states in the region to prevent any form of attacks on their communities.\n\nAdvertisement\n\nFailure to pay often led to an incursion of the community by the terrorists. In such cases, fatalities or abductions are inevitable.\n\nIn October alone, the number of fatalities across the country increased by 93.97 per cent with no fewer than 1,127 killed as compared to the fatalities in September where at least 581 were reportedly killed.\n\nAccording to Beacon Consulting, a security and risk assessment organisation, the North East recorded 38.5 per cent of fatalities in October.\n\nBorno State topped the list with 326 cases and Yobe State came third after Zamfara, with 60 cases of death.\n\nThe North East also ranked high in the abduction cases that occurred in October across the country.\n\nAt least 518 people were reportedly abducted in the country, and 48.8 per cent of these cases were recorded from the North East.\n\nAdvertisement\n\nTwo states in the region made the top five including Borno with 196 cases of abduction at the top of the list, and Taraba as the fifth on the list with 26 cases of abduction.",
        "lang": "en"
    },
    {
        "title": "Tinubu inherited an empty treasury from Buhari – NSA",
        "external_url": "https://dailypost.ng/2023/11/14/tinubu-inherited-an-empty-treasury-from-buhari-nsa/",
        "publication_author": [
            "Chris Johnson"
        ],
        "publication_date": 1699920000000,
        "description": "",
        "text": "The National Security Adviser (NSA), Nuhu Ribadu, has disclosed that the financial distress currently plaguing the country is a direct result of President Bola Tinubu’s administration inheriting an empty treasury upon assuming power a few months ago.\n\nWhile speaking at the Chief of Defence Intelligence Annual Conference 2023 in Abuja on Monday, Ribadu acknowledged the severe financial constraints affecting budgetary allocations but reassured the nation that the federal government is committed to maintaining a robust and viable defense management and mechanism.\n\n“I assure you that the federal government will not rest on its oars in ensuring a robust and viable defence management and security apparatus to address contemporary challenges even in the face of enormous budgetary constraints.\n\n“Yes, we’re facing budgetary constraints. It is okay for me to tell you. Fine, it is important for you to know that we have inherited a very difficult situation, literally a bankrupt country, no money, to a point where we can say that all the money we’re getting now; we’re paying back what was taken. It is serious!\n\n“But this administration is doing its best to meet our requirements, particularly the armed forces, and I believe that you leaders will be able to testify to that.” Ribadu said\n\nHe commended the armed forces for their dedication to addressing prevailing security challenges, both within and outside Nigeria, noting positive changes and improvements. Urging unity and support for the country’s security agencies, Ribadu expressed confidence that with leadership resolve, the nation would overcome its current difficulties.\n\n“Let us come together as one and continue to support our armed forces and other security agencies with this work of securing our country for peace and stability.\n\n“They have done an amazingly good job without talking and I believe that with the support and the resolve of the leadership we have today in our country, things will only be better.\n\n“We are just four or five months old, but certainly things have changed and we believe that what they are doing, they are doing it right. We want to encourage them, stand by them and support them 100 percent and hopefully, this country will be okay in a short time,” he added.\n\nRibadu pointed to recent coups in Mali, Burkina Faso, Niger, Gabon, and Guinea, characterizing them as sudden reversals of democratic fortunes. He stated the importance of defense diplomacy in pursuing strategic engagements with allies and partners to achieve national security objectives.\n\nThe Chief of Defence Intelligence, Maj Gen Emmanuel Undiandeye, in his response, affirmed the agency’s determination to harness the capabilities of the defense attaché system for the attainment of national security objectives.\n\nThe conference was attended by key figures, including the Minister of Defence, Minister of State, and other high-ranking officials in the Defense Ministry.",
        "lang": "en"
    },
    {
        "title": "PHOTOS: Nigerian Military'll Soon Deploy 'Soft-Power' for Anti-Terrorism War",
        "external_url": "https://prnigeria.com/2024/01/22/nigerian-military-soon-deploy/",
        "publication_author": [
            "Kabir Abdulsalam"
        ],
        "publication_date": 1705881600000,
        "description": "",
        "text": "Nigerian Military’ll Soon Deploy ‘Soft-Power’ for Anti-Terrorism War – CDS Declares at Psyops Programme\n\nThe Chief of Defence Staff, Gen. Christopher Musa, announced on Monday that the military is revamping its counter-insurgency strategy to utilize both military force and non-military tactics.\n\nIn a lecture titled “Non-Kinetic Operations and the Nigerian Armed Forces,” delivered at the launch of a national security course on `Psychological Operations and Strategic Communication (PSYOPS) in Abuja.\n\nGen Musa emphasized the need for a dual-pronged approach to contain the dynamic nature of current adversaries.\n\nThe Defence Intelligence Agency (DIA) organized the course on the theme ‘Winning Hearts and Minds for National Cohesion and Development’.\n\nRepresented by Rear Adm. Daupreye Matthew, Director of Training, Defence Headquarters, the CDS said that the use of non-kinetic efforts under Operation Safe Corridor had led to the surrender of more than 2,000 Boko Haram members between 2016 and 2017.\n\nHe said 67 per cent of those who surrendered were of the Abubakar Shekau faction of the insurgents.\n\nMusa added that 1,543 repentant terrorists graduated from Mallam Sidi Camp in Gombe State and 1,935 were released from Bulumkutu camp in Borno between 2016 and 2022.\n\nAccording to him, from July 2021 to May 4, 2022, alone, no fewer than 51,828 terrorists and their family members surrendered, out of which 13,360 were fighters.\n\nHe added that 106,000 terrorists and their family members had so far surrendered in the North East.\n\nThe defence chief, however, called for assessment and content analysis of the security policies and legal and operational frameworks.\n\nHe also called for the upscaling of government support, including developing and implanting of vetting systems, as well as capacity building for government service providers and direct assistance to transitional facilities working with low-risk individuals.\n\nHe further advocated individual case management, referral services, and community-based peace-building, reconciliation, and reintegration.\n\nEarlier, the Chief of Defence Intelligence (CDI), Maj.-Gen. Emmanuel Undiandeye said the five-day programme was designed to boost security experts’ understanding of the dynamics of psychological operations and strategic communication.\n\nUndiandeye described psychological operations and strategic communication as integral elements of modern warfare. Despite their importance, communication science has widely neglected them.\n\nAccording to him, it is now used to manipulate an enemy’s will to fight and influence public opinion.\n\nHe said the employment of strategic communication influences operations and non-kinetic tools to win hearts and minds and enhance national security and cohesion.\n\n”Suffice it to say that the importance of PSYOPS as an instrument of statecraft, governance, and national security cannot be overemphasised.\n\n”The Agency is more intentional about the benefits of the application of PSYOPS instruments, which include the use of soft power in the attainment of national security objectives.\n\n”I am fully aware that the distinguished participants of this course were drawn from the various Federal and State MDAs, including the Armed Forces, Police, other sister intelligence and security agencies, and the media,” he said.\n\nThe CDI said the course intended to reconnect with communities and enlighten them on the importance of lawful conduct as against the activities of criminals, insurgents, and other deviants.\n\nHe said the government needed to harmonise processes and procedures for collaboration with communities most impacted by security challenges.\n\nOther speakers on the first day of the programme included a respected psyop specialist, Colonel SO Gbenoba (Rtd); Director of Psychological Operations at the Defence Intelligence Agency, Mrs CA Usman; Head Preventing and Countering Violence Extremism at the Office of the National Security Adviser, Hajiya Musa-Abbas and the publisher of PRNigeria, Mr. Yushau A. Shuaib.\n\nBy PRNigeria",
        "lang": "en"
    }
]